[
    {
        "page": "xvii",
        "text": "Experienced researchers If you are reading this book as an experienced researcher, you can dip into those chapters that explain any research approaches with which you are unfamiliar. I also recommend that you read the first three chapters,"
    },
    {
        "page": "21",
        "text": " a few strokes, but he has learned to accept the discoveries of others with the same delight that he experienced his own when he was young. (Cecilia Payne- Gaposchkin (astronomer). Excerpt from acceptance speech and memorial lecture"
    },
    {
        "page": "213",
        "text": "The idea is that you watch an experienced person going about their work, but ask them to talk about it as they do it. (You may need to prompt them - 'what are you doing now?' - as they become engrossed in the task and forget to talk aloud.)"
    },
    {
        "page": "344",
        "text": "The book is also suitable for individual study by novice researchers, or for more experienced researchers wanting to learn about alternative research approaches. BRIONY J DATES is Reader in Information Systems at the University of"
    },
    {
        "page": "55",
        "text": "This description is scrutinized by people outside the project, often by members of an experienced research ethics committee. They will want to satisfy themselves that people affected by the research in any way will not be harmed and will be"
    },
    {
        "page": "88",
        "text": "This failure might be experienced as rigid inflexible systems which cannot adapt to changing circumstances, the neglect of human needs and aspirations, or users' poor productivity, lack of motivation or resistance to change (Walsham, 1993, p."
    },
    {
        "page": "259",
        "text": " no difference between the average scores of novice and experienced data entry personnel on the ABC reactions test. q There is no relationship between mathematical ability and programming ability. q There is no association between size"
    },
    {
        "page": "xv",
        "text": "Here are some suggestions on how to use this book, whether you are an individual novice researcher, a lecturer or instructor using it as a course text, or an experienced researcher. Individual novice researchers If you are a novice researcher,"
    },
    {
        "page": "179",
        "text": "Ethnographers cannot reproduce everything they saw, heard or experienced, so by choosing to concentrate on some aspects and omitting others, they are constructing a partial account of a culture. They also decide what detail to give about"
    },
    {
        "page": "xvi",
        "text": " particular strategy or method, and present their research process and findings to the class. The other class members then analyse and evaluate their colleagues' work. Experienced researchers If you are reading this book as an ( xvi Preface V."
    },
    {
        "page": "89",
        "text": "This failure might be experienced as rigid inflexible systems which cannot adapt to changing circumstances, the neglect of human needs and aspirations, or users' poor productivity, lack of motivation or resistance to change [4, p. 30]. 1 ."
    },
    {
        "page": "211",
        "text": " research is over, they can't make the strange become familiar again, and can't go back to being a 'normal' practitioner. Practitioner- researchers can therefore end up unhappy and stressed in their jobs. The feelings experienced have even"
    },
    {
        "page": "104",
        "text": "They analyse the data obtained to argue that successful project management depends on a project team being stable, experienced and cohesive, and having effective management of risk, senior management support and active user"
    },
    {
        "page": "139",
        "text": " a Frequent computer crashes create frustration. b Children learn more from interactive multimedia CDs than from books. c Men are better programmers than women. d Novice programmers spot fewer bugs than experienced programmers."
    },
    {
        "page": "208",
        "text": "In participant observation, the researcher takes part in the situation under study, so that it can be experienced from the point of view of the others in that setting. This can be overt - people know that you are carrying out research into what they"
    },
    {
        "page": "149",
        "text": " the original theory of why the system was a good idea), are experienced in practice, and what unforeseen modifications are needed once the system is used in real life. Some examples of the use of a case study strategy in IS and computing"
    },
    {
        "page": "xiv",
        "text": "It can also be helpful to more experienced researchers who want to learn about particular research approaches with which they are not currently familiar. IS researchers study how information systems are developed and used by individuals,"
    },
    {
        "page": "235",
        "text": "She will also analyse visual data such as the photographs and images used, to see whether more men than women are featured, and whether any messages are conveyed about the respective roles of men and women in computing."
    },
    {
        "page": "297",
        "text": "They would look at how the wider societal history of perceptions about differences between men and women and the relative importance of men and women have shaped the members' shared way of running their organization. They would do"
    },
    {
        "page": "139",
        "text": "1 Study the following statements and write down the independent and dependent variables in each: a Frequent computer crashes create frustration. b Children learn more from interactive multimedia CDs than from books. c Men are better"
    },
    {
        "page": "19",
        "text": "How does the advent of Internet shopping affect family relationships in the home? Stereotypes suggest women do the weekly grocery shopping, but men are the main technology users, so who does the shopping from an online supermarket?"
    },
    {
        "page": "59",
        "text": "For example, if you are writing about the views of a company's IT department, where only one woman and many men work, it would be easy for readers to know which comments were attributable to the woman, unless you changed her gender"
    },
    {
        "page": "195",
        "text": "However, there are also disadvantages, including: q Some members (often men or those higher up in a company hierarchy) might dominate the talk and the quieter ones (often women or those lower down in a company hierarchy) struggle to"
    },
    {
        "page": "232",
        "text": "Validating instruments in MIS research. MIS Quarterly, 13, 147-169. Venkatesh, V., &amp; Morris, M.G. (2000). Why don't men ever stop to ask for directions? Gender, social influence and their role in technology acceptance and usage behaviour."
    },
    {
        "page": "238",
        "text": "Always remember that documents present only a partial view or account of something aimed at a particular audience for a particular purpose. For example, many formal organizational records are intended to show and enhance accountability."
    },
    {
        "page": "179",
        "text": "Ethnographers cannot reproduce everything they saw, heard or experienced, so by choosing to concentrate on some aspects and omitting others, they are constructing a partial account of a culture. They also decide what detail to give about"
    },
    {
        "page": "175",
        "text": " holding themselves in readiness for episodes of embarrassment, affection, misfortune, partial or vague revelation, deceit, confusion, isolation, warmth, adventure, fear, concealment, pleasure, surprise, insult and always possible deportation."
    },
    {
        "page": "300",
        "text": "Indeed, one of the key concerns of ethnographers in recent years has been to recognize that writing up their research is a creative act whereby they construct just one partial interpretation of a culture and also create a form of se//-presentation"
    },
    {
        "page": "211",
        "text": "vital that you do not forget your research purpose and do not lose your researcher's independent way of seeing things. However, being required to operate at two levels - as a participant and a detached observer - is stressful. When you have"
    },
    {
        "page": "213",
        "text": "as they become engrossed in the task and forget to talk aloud.) This allows you to observe how an expert operates: the gathering and analysis of data, reasoning, theory formation and backtracking. This can then be incorporated into the"
    },
    {
        "page": "58",
        "text": "Even in private settings permission is often given, and the people usually soon forget the observer's presence and behave as they normally do. Sometimes informed consent cannot be obtained because the research participants are too young"
    },
    {
        "page": "209",
        "text": "If you gain the people's trust, so that they accept your presence and even forget that you are there sometimes, you can learn about what they do and how they feel about it. A practitioner-researcher is someone who already has a job and"
    },
    {
        "page": "241",
        "text": "Nor can any other data generation method, but the official, authoritative-looking nature of many documents means that researchers sometimes forget this. • Access to some types of documents is expensive or impossible, or, particularly for"
    },
    {
        "page": "3",
        "text": "lack. of. evidence. There are plenty of computer science theories that haven't been tested. For instance, functional programming, object-oriented programming, and formal methods are all thought to improve programmer productivity, program"
    },
    {
        "page": "88",
        "text": "Example. of. the. Harvard. referencing. system. (author,. date). Conventional ISO methodologies are criticized for paying insufficient attention to the organizational context of computer systems. It is argued that the lack of consideration of the"
    },
    {
        "page": "89",
        "text": "Briony J Oates. Example of referencing convention using numbers Conventional ISO methodologies are criticized for paying insufficient attention to the organizational context of computer systems. It is argued that the lack of consideration of the"
    },
    {
        "page": "169",
        "text": "4 Do the researchers discuss the extent of participation achieved, and any limitations in their claimed outcomes caused by lack of full participation? 5 Do the researchers recognize the problems of self-delusion or group-think, and explain"
    },
    {
        "page": "175",
        "text": " accurate ones. This may not be the way field- work is reported, but it is the way it is done. (Van Maanen, 1 988, p. 2) This lack of defined procedures, together with no formal mechanisms for judging the accuracy of an ethnographer's results,"
    },
    {
        "page": "198",
        "text": "Disadvantages of interviews as a data generation method in research include: • They are time-consuming for the researcher - the interview itself plus transcribing plus analysis of unstructured data. q There can be a lack of reliability - the effect"
    },
    {
        "page": "14",
        "text": "The section 'Evidence-based Practice' pointed to the lack of evidence for many of the ideas about appropriate methods and products in computing. Study Hirschheim and Newman (1 99 1). This paper is now quite old - consider whether the"
    },
    {
        "page": "215",
        "text": "It is sometimes criticized for lack of reliability, since the research depends on the researcher's 'self and is difficult to repeat by another researcher. q It is difficult to generalize from observations in one setting to others - any findings may be"
    },
    {
        "page": "157",
        "text": "Nevertheless, the action research process still needs to be structured and managed to avoid criticisms about lack of rigour. Researchers should be clear about whether they are currently planning, acting or reflecting, and must generate data"
    },
    {
        "page": "61",
        "text": "If on a computer you should think about how lack of password security, insecure networks, power failures, poor backup procedures, hackers and viruses might compromise your data. As explained in the previous section, you should try to"
    },
    {
        "page": "99",
        "text": "Whenever possible, you should devise a way of finding out at least some characteristics of the people who have not responded, so that you can analyse whether their non-response is meaningful in its own right, or whether their lack of"
    },
    {
        "page": "105",
        "text": "Disadvantages of surveys include: q They lack depth. They do not provide much detail on research topics; instead the focus is on breadth of coverage. q They tend to focus on what can be counted and measured, and subject to statistical"
    },
    {
        "page": "104",
        "text": " scientific method (see Chapter 19). • Surveys via postal or web questionnaire, observations or documents are suited to people who do not have good inter-personal and communication skills. Disadvantages of surveys include: q They lack"
    },
    {
        "page": "167",
        "text": " engineering or web engineering methods should consider whether action research is the most appropriate strategy for them. However, you should discuss this with your supervisor, since its lack of recognition in computing could cause you"
    },
    {
        "page": "301",
        "text": " that are testable in further studies, allowing repeatability and generalizations. However, action research is always likely to be criticized by positivists for lack of researcher objectivity: the action researcher is not an objective observer but"
    },
    {
        "page": "149",
        "text": "Some examples of the use of a case study strategy in IS and computing research are: q Markus (1983) uses a case study to investigate user resistance to the implementation of management information systems. She looks at three different"
    },
    {
        "page": "297",
        "text": " so the developer (often unthinkingly) ends up serving as a tool for the managers, helping to increase their productivity and restricting employee resistance. q Non-performative intent: critical researchers reject research projects that are aimed"
    },
    {
        "page": "88",
        "text": "This failure might be experienced as rigid inflexible systems which cannot adapt to changing circumstances, the neglect of human needs and aspirations, or users' poor productivity, lack of motivation or resistance to change (Walsham, 1993, p."
    },
    {
        "page": "89",
        "text": "This failure might be experienced as rigid inflexible systems which cannot adapt to changing circumstances, the neglect of human needs and aspirations, or users' poor productivity, lack of motivation or resistance to change [4, p. 30]. 1 ."
    },
    {
        "page": "153",
        "text": "Resistance or deviance: A high-tech workplace during the bursting of the dot-com bubble. In B. Kaplan, D.P.I. Truex, D. Wastell, T. Wood-Harper, &amp; J.I. DeGross (Eds.), Information systems research. Relevant theory and informed practice (pp."
    },
    {
        "page": "301",
        "text": "For example, three theories about resistance to efforts to implement management information systems were used to generate predictions about what would happen in a particular company. By examining which events did actually occur, it was"
    },
    {
        "page": "39",
        "text": "Conceptualize, operationalize, generalize This model has three stages. You start off by conceptualizing the research topic - you make explicit what the question or problem is and how you propose to address it. This includes the theories from"
    },
    {
        "page": "35",
        "text": "You then look for patterns in the data using statistics so that you can generalize to a larger population than the group you targeted. (See Chapter 7.) q Design and creation: focuses on developing new IT products, or artefacts. Often the new IT"
    },
    {
        "page": "122",
        "text": "Enthusiasm is no substitute. q It can be difficult to generalize to different settings from the use of an IT artefact in a single situation. • The (apparent) success of an IT artefact may depend on the researchers being present - once they've gone,"
    },
    {
        "page": "215",
        "text": "It is sometimes criticized for lack of reliability, since the research depends on the researcher's 'self and is difficult to repeat by another researcher. q It is difficult to generalize from observations in one setting to others - any findings may be"
    },
    {
        "page": "93",
        "text": "You then look for patterns in the data that you can generalize to a larger population than the group you targeted. For example, opinion pollsters might survey the views of around 1000 people and analyse the results to draw conclusions about"
    },
    {
        "page": "100",
        "text": "If you want to generalize your findings from the sample to the whole population in which you are interested, the sample must be of an adequate size (see the box below). The greater the accuracy required in your claim that your sample"
    },
    {
        "page": "24",
        "text": "Sometimes, two or more examples are critically analysed and compared. For example, during the 2001 foot and mouth disease outbreak in the UK, a study analysed and evaluated how different local governments used their websites to inform,"
    },
    {
        "page": "66",
        "text": "For example, ethnographers (Chapter 12) and other interpretive researchers (Chapter 20) often cannot specify in advance the topics they will cover during interactions with their informants. Themes will emerge only during prolonged"
    },
    {
        "page": "145",
        "text": "I carried out four case studies, looking at how some local governments used their websites during the FMD outbreak: the information presented and the different audiences addressed. The data provided empirical evidence for a theory about"
    },
    {
        "page": "192",
        "text": " are used to make sure you have understood your interviewee correctly, and should be performed at regular points during the interview. They can also be used to conclude the discussion on one of your themes prior to moving on to the next"
    },
    {
        "page": "203",
        "text": "It can be used in academic research to study, for example, behaviour at meetings or on a production line, or interactions between end- users and staff on an IT help-desk, or what students are really doing during a programming tutorial in a"
    },
    {
        "page": "158",
        "text": " explicit: • the objectives of the project and how it will be evaluated; • the roles and responsibilities of the various participants; q any organizational constraints (for example, no changes to be implemented during the peak trading season)."
    },
    {
        "page": "59",
        "text": "Sometimes you might also have to change their gender during your writing-up, or disguise them in other ways. For example, if you are writing about the views of a company's IT department, where only one woman and many men work, it would"
    },
    {
        "page": "213",
        "text": "For example, Mao and Benbasat (1998) used verbal protocol analysis to investigate the interactions between some users and an expert system during an exercise to assess an organization's financial health. Observation is often used within a"
    },
    {
        "page": "198",
        "text": "q Hine (2000) used email 'interviews' to ask web developers about how and why they had developed their websites during the Louise Woodward case (who was accused of killing a baby in her care). Hine supplies the first email she sent out"
    },
    {
        "page": "268",
        "text": "For an example of such analysis, see Figure 18.1 from a piece of research concerned with looking at the use of metaphors during information systems development. To start with, your choice of categories is not crucial - you'll have plenty of"
    },
    {
        "page": "122",
        "text": "5 Do the researchers describe their use of any data generation methods during their design and creation work? Is the description satisfactory? 6 What do the researchers tell you about how they evaluated their IT artefact? (Proof of concept?"
    },
    {
        "page": "132",
        "text": "You could test 4-year-olds' competency at some task, and test them again at 6 years old - their performance is likely to have improved regardless of any manipulation you had done during the past 2 years. Maturation can also be a problem"
    },
    {
        "page": "190",
        "text": " such as body language. Occasionally, an interviewee might refuse you permission to make notes during an interview - you must, of course, respect their wishes, but write up your recollections as best you can later. It's not easy to write notes,"
    },
    {
        "page": "54",
        "text": "Before we look in detail at the research process, it is important that we look at another of the 6Ps of research - the participants - and consider how they should act or be treated during research. These participants include: q the people directly"
    },
    {
        "page": "157",
        "text": "This data should be recorded in a form that can be referred to both during and after the completion of the action part of the research, and that can be analysed by people other than those directly involved in order to judge the validity or"
    },
    {
        "page": "242",
        "text": "3 Try to keep a copy of all the documents you handle during the next week (memos, emails, shopping till receipts, travel tickets, and so on). What could a future historian learn about you and your life from these documents? Study a piece of"
    },
    {
        "page": "214",
        "text": "Examples of Internet-based observations include: • Hine's (2000) study of newsgroups during the trial of Louise Woodward, who had been accused of the murder of a baby in her care; • Denzin's (1999) covert observation of an online, self-help"
    },
    {
        "page": "150",
        "text": " small software development company during the dot.com boom and bust era. She analyses how the owners and managers used various techniques to increase their control over the employees, and how the developers at first accepted but"
    },
    {
        "page": "270",
        "text": "For example, in the study mentioned earlier that looked at the use of metaphors during information systems development, a table was used to correlate use of particular metaphors at observed meetings against the date - see Figure 18.2."
    },
    {
        "page": "146",
        "text": " look for during data analysis. Of course, the danger of this is that the researcher might be too rigid in sticking M46 Researching Information Systems and Computing V."
    },
    {
        "page": "320",
        "text": "Many conferences include a formal conference dinner, where delegates normally wear something a little smarter than they have worn during the day, but not very formal - tuxedos and ball-gowns would be way over the top. Many conference"
    },
    {
        "page": "191",
        "text": "Also, tapes do not capture the non-verbal communication and context of the interview. q Video tape recording can capture non-verbal communication and provides a more complete record of events during the interview. However, the"
    },
    {
        "page": "174",
        "text": " the findings are unlikely to be repeated by someone else, because someone else would, no doubt, experience different things during their time in the studied culture. This argument arises from different ideas about what we mean by"
    },
    {
        "page": "310",
        "text": "However, if you have to produce a PhD thesis or other long account of the research, it is also a good idea to write some of its chapters during the research project. Reasons for this include: q If you leave all the writing up until the last minute,"
    },
    {
        "page": "45",
        "text": "There are also suspicions of email addiction, where people feel compelled to check their emails regularly, even during their leisure or holiday time. Some have found ways of using email to manipulate or even bully other organization members"
    },
    {
        "page": "28",
        "text": "If you think you do, then you should choose another topic since you are unlikely to be sufficiently open-minded during the research. q Will the research be safe and ethical? You should be able to carry it out without breaking the law, without"
    },
    {
        "page": "266",
        "text": "You can use quantitative (numerical) analysis on qualitative data. For example you could: • Count the number of times a particular word or phrase occurs in some text. For example, during interviews with systems developers, how often do they"
    },
    {
        "page": "71",
        "text": "In this chapter you will learn about: q the purpose of a literature review; q the range of available literature resources; • how the Internet can be used during a literature review; q how to do a literature review. Early in their research, most students"
    },
    {
        "page": "153",
        "text": "Resistance or deviance: A high-tech workplace during the bursting of the dot-com bubble. In B. Kaplan, D.P.I. Truex, D. Wastell, T. Wood-Harper, &amp; J.I. DeGross (Eds.), Information systems research. Relevant theory and informed practice (pp."
    },
    {
        "page": "37",
        "text": "For example, a researcher using an action research strategy in an organization might interview people, observe what occurs, ask some people to complete a questionnaire and collect documents produced during the action research project."
    },
    {
        "page": "136",
        "text": "Any decrease might be attributable to the posting of the rules, but the researcher would have to look for other causes such as the main flamers not taking part in the discussion during the time of the experiment (on holiday? not interested? too"
    },
    {
        "page": "92",
        "text": "Metaphors for organizations during information systems development. PhD thesis, University of Teesside. Webster, J., &amp;t Watson, R.T. (2002). Analyzing the past to prepare for the future: Writing a literature review. MIS Quarterly, 26(2), xiii-xxiii."
    },
    {
        "page": "310",
        "text": "Getting started As Chapter 2 indicated, most researchers find that the act of writing helps them to clarify their ideas, to discover what they really think. If you followed the advice of that chapter, you will have been writing about your research as"
    },
    {
        "page": "323",
        "text": "Answer the questions in the Evaluation Guide' for oral presentations above, using the material in this chapter to help you. Useful and humorous guides to writing up research include Becker (1986) and Day (1998). Wolcott (2001) is a short,"
    },
    {
        "page": "179",
        "text": "Ethnographers also recognize that the act of writing up their research is not a selfless, objective act. It is a creative act. Ethnographers cannot reproduce everything they saw, heard or experienced, so by choosing to concentrate on some"
    },
    {
        "page": "29",
        "text": "The main reason for writing all this down, rather than just thinking it through in your head, is that most researchers find that the act of writing is not just record- making; it helps them to clarify their ideas, to discover what they really think."
    },
    {
        "page": "324",
        "text": "Chicago, IL: University of Chicago Press. Collier, J.H. (1996). Scientific and technical communication. Theory, practice, and policy. London: Sage. Davis, G.B., &amp; Parker, C.A. (1997). Writing the doctoral dissertation (2nd ed.). New York: Barron's"
    },
    {
        "page": "313",
        "text": "Developing a writing routine Everyone develops a preferred mode of writing. You have to find the way that suits you best. Some set themselves a target: 1500 words every day, or 500 words before they're allowed a cup of coffee. Others might"
    },
    {
        "page": "59",
        "text": "Sometimes you might also have to change their gender during your writing-up, or disguise them in other ways. For example, if you are writing about the views of a company's IT department, where only one woman and many men work, it would"
    },
    {
        "page": "78",
        "text": "For example, at the time of writing, the ISWorld website (www.isworld.org) offers lists of references on topics such as e-commerce, knowledge management, IS assessment and IT in developing countries. Gateways Academic gateways (also"
    },
    {
        "page": "86",
        "text": "Such software packages often provide a link to commonly used word-processing packages, so that when writing your report you can automatically insert the bibliographic details of each source without having to type them out again. However"
    },
    {
        "page": "92",
        "text": "Although their advice is aimed at authors wishing to submit papers to M/SQ Review, it is useful for anyone writing a critical review, whether as a journal paper or as part of a report or thesis. Ned Kock (1999) discusses what happened and the"
    },
    {
        "page": "x",
        "text": "Presentation of the Research 309 Writing up the research 309 Conference paper presentations 314 Posters and exhibitions 318 Software demonstrations 319 Presenting yourself 319 PhD vivas 320 Evaluating presentations 322 Practical"
    },
    {
        "page": "13",
        "text": "Chapters 19 and 20 discuss the philosophical paradigms of research (positivism, interpretivism and critical research). Chapter 21 covers writing up your research and research presentations. At the end of each chapter there are some practical"
    },
    {
        "page": "336",
        "text": " 8, 320-2 posters and exhibitions 318-19 reviews 134 self-presentation 319-20 software demonstrations 319 writing up research 310-14 presentational knowledge 165 Prior, L. 238, 243 private settings 58, 239 prizes 55 probability sampling"
    },
    {
        "page": "75",
        "text": "Conference and workshop proceedings Often researchers will present their work initially via a paper at a conference or workshop, before writing and submitting a more detailed journal article. Conference and workshop proceedings are"
    },
    {
        "page": "328",
        "text": " 300 evaluating 305 and grounded theory 276 and IS (information systems) research 304 overview 296—7 quality of research criteria 298-9 and surveys 93 critical reviews, writing 86-9 Cryer, P. 30 culture 66-7, 197 see also anthropology;"
    },
    {
        "page": "330",
        "text": " participant observation 174, 178, 208 philosophical paradigms 174, 178, 300 planning and conducting description, theory and generalization 177- field notes 176-7,233 reflexivity 178-9 testing of success 179 types 175-6 writing up 179 and"
    },
    {
        "page": "159",
        "text": " of application (A), following the researchers' suggestions and identifying practical outcomes? And have they been involved in the writing up and dissemination of the research findings? Control over the formulation of the research questions,"
    },
    {
        "page": "237",
        "text": " for example, Qualidata at the University of Essex (UK), and at the time of writing, several countries are considering whether to set up national qualitative data archives including Germany, Switzerland and Canada. Possible uses of secondary"
    },
    {
        "page": "333",
        "text": " 254 Linux operating system 17 list questions 224 literature reviews case study 82 conducting assessing 83-4 critical evaluation 85 obtaining 83 reading 84-5 recording 82, 85-6 searching 80-3 writing critical reviews 86-9, 310 evaluating 90"
    },
    {
        "page": "160",
        "text": "I suggest that in writing about and reading about action research projects, attention should be paid to the extent of participation achieved. Readers should know the degree of involvement of those affected, the political relationships between the"
    },
    {
        "page": "177",
        "text": "Field notes can also serve as a crutch - by making notes when nothing much seems to be happening, or by going through your previous notes and writing new comments, you still feel like you're an ethnographer. You can use a notebook"
    },
    {
        "page": "268",
        "text": " of the types described above - the sections that are relevant to your research question(s). You need to categorize each segment or unit of data (a unit might be a word, sentence, paragraph or even a page), by writing in the margin a heading,"
    },
    {
        "page": "338",
        "text": " data requirements 94 evaluation 40 and research process model 33, 34 in research topic selection 27, 28, 30 and writing critical reviews 87 research topics, selection 25-9, 45-7 researcher-administered questionnaires 219-20,221 see also"
    },
    {
        "page": "185",
        "text": "Tales of the field: On writing ethnography. Chicago, IL: University of Chicago Press. Van Maanen, J. (1995). An end to innocence: The ethnography of ethnography. In J. Van Maanen (Ed.), Representation in Ethnography (pp. 1-35). Thousand"
    },
    {
        "page": "228",
        "text": "It is thought that Internet-delivered questionnaires need to be shorter than paper and pencil questionnaires because: • Most people are slower at typing and mouse clicks than they are at writing and putting ticks in boxes. Respondents may"
    },
    {
        "page": "31",
        "text": "Writing the doctoral dissertation (2nd ed.). New York: Barron's. Morgan, G. (1986). Images of organization. Beverly Hills, CA: Sage. Oates, B.J. (2002). Foot and mouth disease: Lessons from local government websites. In D. Remenyi (Ed.), 2nd"
    },
    {
        "page": "326",
        "text": " 59, 64, 65, 191 anthropology 174 AolR (Association of Internet Researchers) 62,69 APA (American Psychological Association) 62 application, area of in action research 156-7, 159 argument, in writing up research 7-8, 312-13 Arksey, H. 201"
    },
    {
        "page": "57",
        "text": "It is considered good practice to provide these details in writing to each potential participant. However, this should be a concise description, not pages and pages for people to plough through, and written in language that is easy for the"
    },
    {
        "page": "xv",
        "text": "These were all correct at the time of writing this book but, of course, sites move and change their address or disappear entirely. If a web address no longer seems to be valid, try entering relevant keywords into a search engine - often this will"
    },
    {
        "page": "300",
        "text": "Indeed, one of the key concerns of ethnographers in recent years has been to recognize that writing up their research is a creative act whereby they construct just one partial interpretation of a culture and also create a form of se//-presentation"
    },
    {
        "page": "176",
        "text": " or that lead to new theories or working models. The notes become a source of evidence and a basis for data analysis in the writing up of the ethnography. It is essential that you write field notes regularly. Don't worry about whether something"
    },
    {
        "page": "327",
        "text": " (see design and creation) development 2, 9, 110 empirical assessment of systems 2-3, 14, 18 evaluation 2, 9, 99 and research process model 35 as research product 24 uncompleted 27 writing up research 311 computer-based systems 19,"
    },
    {
        "page": "46",
        "text": "Its information and communication technologies also enable new types of play, such as online games, new ways of communication, such as blogging (online diary-writing), and new means of teaching, such as distance learning. All of these"
    },
    {
        "page": "276",
        "text": " apply your own code or categories to units of text; • data organization - to help you organize and file your data; q writing tools - to enable you to write your own notes and self-memos; q visual displays - to show links between data segments;"
    },
    {
        "page": "341",
        "text": " 158, 159, 167, 170, 303 Work-Learning Research 91-2 workshop proceedings, in literature reviews 75,84 World Wide Web 4, 44, 45, 119, 236 writing up critical reviews 86-9, 310 ethnography 179 research 3 10-14, 322 research topics 28-9"
    },
    {
        "page": "218",
        "text": "In Proceedings of the Agile Development Conference 2003 (pp. 12-21). Los Alamitos, CA: IEEE Computer society. Van Maanen, J. (1988). Tales of the field: On writing ethnography. Chicago, IL: University of Chicago Press. 5 Questionnaires In"
    },
    {
        "page": "58",
        "text": "It is also often recommended that the participants' consent be given in writing. However, such written consent should not be interpreted as a formal, binding contract - a participant can withdraw at any time. There are some cases where it is not"
    },
    {
        "page": "28",
        "text": "Even though PhD students have a long period of time available, they can still be caught out by not allowing enough time for such things as gaining access to a particular research context and writing the thesis. Note that funding bodies are"
    },
    {
        "page": "80",
        "text": "We can break a literature review down into seven different activities, each of which is discussed in this section: searching, obtaining, assessing, reading, critically evaluating and writing a critical review. Finally, when conducting a literature"
    },
    {
        "page": "71",
        "text": " carries on throughout the remainder of the research time, up to and including writing the thesis or dissertation and preparing for a viva or presentation - in case a paper relevant to your research is published at the last minute. The aim is to"
    },
    {
        "page": "iv",
        "text": " Designs and Patents Act, 1988, this publication may be reproduced, stored or transmitted in any form, or by any means, only with the prior permission in writing of the publishers, or in the case of reprographic reproduction, in accordance with"
    },
    {
        "page": "263",
        "text": "Briony J Oates. Typically, researchers writing up quantitative data analysis have a 'Results' section, followed by a 'Discussion' section where they interpret the results. Evaluating. Quantitative. Data. Analysis. Of course, if you have generated"
    },
    {
        "page": "3",
        "text": " proposals for new ways of designing and developing computer-based systems, for example, information hiding, design patterns, UML (Unified Modelling Language) and agile development methods such as eXtreme Programming (XP)."
    },
    {
        "page": "18",
        "text": "Can we come up with better ways? Many methods have been proposed over the years, for example, structured methods, agile methods, formal methods. Similarly, many computer-based tools for developers are marketed: analyst workbenches"
    },
    {
        "page": "218",
        "text": "In Proceedings of the Agile Development Conference 2003 (pp. 12-21). Los Alamitos, CA: IEEE Computer society. Van Maanen, J. (1988). Tales of the field: On writing ethnography. Chicago, IL: University of Chicago Press. 5 Questionnaires In"
    },
    {
        "page": "135",
        "text": "However, pre-testing of the participants might have affected their subsequent performance. q Solomon four-group design: this design controls for the possibility of pre-testing affecting subsequent performance, but it is expensive because of the"
    },
    {
        "page": "137",
        "text": "Their experiments were based in a computer laboratory where some psychology undergraduates were observed navigating around a virtual environment. Each subject was faced with four doors in the virtual environment and had free choice"
    },
    {
        "page": "145",
        "text": "I carried out four case studies, looking at how some local governments used their websites during the FMD outbreak: the information presented and the different audiences addressed. The data provided empirical evidence for a theory about"
    },
    {
        "page": "129",
        "text": "A hypothesis must be testable and it must always be possible to disprove, or falsify, the hypothesis. For example, the statement 'All squares have four sides of equal length and contain four right angles' is not falsifiable, (because something"
    },
    {
        "page": "13",
        "text": " a chapter on each of six research strategies (surveys, design and creation, experiments, case studies, action research and ethnography), one on each of four data generation methods (interviews, observation, questionnaires and documents)"
    },
    {
        "page": "165",
        "text": "This means that at least four different types of knowledge can emerge from action research: experiential, presentational, propositional and practical (Heron, 1996): • Experiential knowledge: gained by direct encounter; almost impossible to put"
    },
    {
        "page": "246",
        "text": " quantitative data analysis - because different analysis techniques are suited to different kinds of data. We are particularly concerned with four different types: nominal, ordinal, ( 246 Researching Information Systems and Computing V CXXVIII."
    },
    {
        "page": "306",
        "text": "Also, Alvesson and Skoldberg (2000) explain and argue for reflexive critical research and offer a four-level framework to categorise reflexivity. They show how culture, language, selective perception and ideology permeate our research"
    },
    {
        "page": "247",
        "text": "We are particularly concerned with four different types: nominal, ordinal, interval and ratio data. Nominal data Nominal data is that which describes categories and has no actual numeric value. For example, a questionnaire might ask about the"
    },
    {
        "page": "121",
        "text": "evaluate the concept via 'proof by demonstration': they have developed an instantiation that supports semantic bookmarks, and they discuss its use by just four users accessing three websites. • Petinot et al. (2004) describe an instantiation."
    },
    {
        "page": "214",
        "text": "They investigated whether the 12 practices of XP give rise to a culture that embodies the four values of XP (communication, simplicity, feedback and courage). Examples of Internet-based observations include: • Hine's (2000) study of"
    },
    {
        "page": "36",
        "text": "In this book we look at four data generation methods: interviews, observations, questionnaires and documents. q Interview: a particular kind of conversation between people where, at least at the beginning of the interview if not all the way"
    },
    {
        "page": "339",
        "text": " 18 and ethnography 182 evaluation 18, 116 evidence-based research 3 experimental design 139-40 interviews 197 'software pioneers' 31 Solomon four-group design 135 space triangulation 37 Spearman's rank correlation coefficient 258"
    },
    {
        "page": "317",
        "text": "Briony J Oates. usually has three or four paper presentations). Sit somewhere where you can quickly and easily reach the podium when it is your turn to present. Doing. the. presentation. Speak slowly, clearly and loudly. It's always useful to"
    },
    {
        "page": "106",
        "text": "Detailed guidance is also provided by De Vaus (2002) in a four-volume set. Shorter and easier-to-read guidance is provided by Punch (2003) and Fowler (2001). Kraemer ( 1 99 1 ) is a collection of papers on survey use in IS. Unfortunately"
    },
    {
        "page": "47",
        "text": "Table 4.1 summarizes some of the possibilities and limitations of basing each of these strategies on the Internet, and Chapters 7-12 discuss the topic in more detail. The book also looks at four data generation methods: interviews, observations"
    },
    {
        "page": "208",
        "text": "Types of participation We'll look at four types of participation: complete observer, complete participant, participant-observer and practitioner-researcher. A complete observer is present in the setting either overtly f 208 Researching Information"
    },
    {
        "page": "287",
        "text": " in our own research. We have to judge the quality, or soundness, of their research, often called the validity of the research. Criteria for assessing the quality of positivist research can be placed under four headings: objectivity, reliability,"
    },
    {
        "page": "39",
        "text": "Both systems development and research are concerned with creating something new: • Systems development creates new software. • Research creates new knowledge. The SDLC has four main stages: analysis, design, implementation and"
    },
    {
        "page": "120",
        "text": "They claim this framework/ model will enable the next generation of CASE tools to support systems modelling and the syntactic and semantic correction of any models produced. They found their argument on formal logic and mathematics, and"
    },
    {
        "page": "121",
        "text": "evaluate the concept via 'proof by demonstration': they have developed an instantiation that supports semantic bookmarks, and they discuss its use by just four users accessing three websites. • Petinot et al. (2004) describe an instantiation."
    },
    {
        "page": "338",
        "text": " 303 self-plagiarism 62-3 self-presentation 319-20 self-selection sampling 98 semantic differential scale 224 semi-structured interviews 188, 197 semiotic analysis 239 semiotic ethnography school 176 Senn, J. 14 sensitive information 187,"
    },
    {
        "page": "45",
        "text": "Current areas of technological research include mobile or ubiquitous computing, the semantic web, grid computing, search engines, web services and web engineering. Many IS researchers are interested in how business organizations can"
    },
    {
        "page": "124",
        "text": " research on information technology. Decision Support Systems, IS, 251-266. Martin, J. (1989). Information engineering. Englewood Cliffs, NJ: Prentice-Hall. Mukherjee, S., Ramakrishnan, I.V., &amp; Kifer, M. (2004). Semantic bookmarking for"
    },
    {
        "page": "119",
        "text": " are still many potential research topics involving design and creation research on some aspect of the Internet or web. Current areas of interest include mobile or ubiquitous computing, the semantic web, grid computing and web engineering."
    },
    {
        "page": "318",
        "text": "Exhibitions. Sometimes a conference programme committee might offer you the opportunity to display a poster about your work, rather than presenting a paper. A room will be made available where all the posters are displayed around the"
    },
    {
        "page": "x",
        "text": "Presentation of the Research 309 Writing up the research 309 Conference paper presentations 314 Posters and exhibitions 318 Software demonstrations 319 Presenting yourself 319 PhD vivas 320 Evaluating presentations 322 Practical"
    },
    {
        "page": "336",
        "text": " 8, 320-2 posters and exhibitions 318-19 reviews 134 self-presentation 319-20 software demonstrations 319 writing up research 310-14 presentational knowledge 165 Prior, L. 238, 243 private settings 58, 239 prizes 55 probability sampling"
    },
    {
        "page": "330",
        "text": " R.D. 157 everyday thinking 4—6 evidence 2-4, 18, 24, 72, 176-7, 295, 313 examiners 73, 320, 321 exhibitions 318-19 experiential knowledge 165 experimental designs 134—5 experimental groups 64, 130, 131, 135 experimental mortality,"
    },
    {
        "page": "258",
        "text": "Finding relationships in the data As well as knowing about the spread and distribution of the values in a data set, we might want to see if there is an association or relationship between the values for one variable and another, or between one"
    },
    {
        "page": "38",
        "text": "The theory (or theories) in your conceptual framework can get you started by suggesting relationships or themes to look for. However, you should not be too wedded to your conceptual framework so that it blinds you to seeing interesting things"
    },
    {
        "page": "162",
        "text": "This world is not made up of separate things, but of relationships, which we co-create, participate in and maintain. We can't stand outside our world as dispassionate observers, we're necessarily already acting in it, forming relationships as we"
    },
    {
        "page": "35",
        "text": "The aim is to obtain a rich, detailed insight into the 'life' of that case and its complex relationships and processes. (See Chapter 10.) q Action research: focuses on research into action. The researchers plan to do something in a real-world"
    },
    {
        "page": "196",
        "text": "Opinion is still divided about whether online interviews are appropriate when the information sought requires the establishment of good inter-personal relationships. Some maintain that such intimacy cannot be achieved online because there"
    },
    {
        "page": "142",
        "text": "A case study, on the other hand, looks at the chosen case within its real- life context, and focuses on all the factors, issues, politics, processes and relationships that constitute the messiness of the real world. By exploring all these factors and"
    },
    {
        "page": "299",
        "text": " experiments can be carefully designed to ensure that the researchers themselves do not influence the outcome. They use quantitative data and mathematical techniques to measure inputs and outputs and the relationships between them."
    },
    {
        "page": "127",
        "text": "In academic research, an experiment is a strategy that investigates cause and effect relationships, seeking to prove or disprove a causal link between a factor and an observed outcome. It is often associated with research in the physical"
    },
    {
        "page": "160",
        "text": "Many writers on action research in the IS literature assume there will be a traditional professional-client relationship. For example, they describe the research protocol (see above) as a researcher-client agreement. But who is the client?"
    },
    {
        "page": "23",
        "text": "For example, Chen (1976) proposed that we should view the world in terms of entities and relationships, leading to the entity-relationship diagrams used in database design. Similarly, Morgan (1986) argued that most organizational analysis"
    },
    {
        "page": "288",
        "text": "Are the researchers justified in saying that A causes B and a causal relationship exists 'in reality'? (See Chapter 9 for further discussion of internal validity.) q External validity: are the research findings generalizable to different people, settings"
    },
    {
        "page": "264",
        "text": "3 What means do the researchers use, if any, for describing the central tendency, distribution and relationships in the data? 4 Do the researchers justify their choice of statistical measures and tests, or assume that the reader will know what"
    },
    {
        "page": "144",
        "text": " and explain what is going on. q A longitudinal study involves the researcher investigating the case over time, anything from one month to several years, analysing those processes and relationships that are continuous and those that change."
    },
    {
        "page": "246",
        "text": "It should help you to employ tables and charts to visualize your data, use appropriate means to describe it, and choose some methods to examine trends and relationships within it. It does not provide a tutorial on each technique (there's not"
    },
    {
        "page": "332",
        "text": " 95, 102, 228-9 and research strategies 48-9 as research topic 45-7 and surveys 48, 50, 95, 102-3, 104 Internet Archive 240, 243 interpersonal relationships, and interviews 191-2, 195, 196, 198 interpersonal skills 104, 192-4, 195, 197, 198,"
    },
    {
        "page": "278",
        "text": "(Text only, or non-textual tool) 2 Do the researchers claim to have used a grounded theory approach? If so, do you agree that they did? 3 What themes and relationships do the researchers identify in the data? 4 Were emerging categories and"
    },
    {
        "page": "137",
        "text": "Where people have not received any formal research methods training, this is often the only research strategy they know. q They are the only research strategy that can prove causal relationships. q Laboratory experiments permit high levels of"
    },
    {
        "page": "141",
        "text": " observation, document analysis and/or questionnaires - see Chapters 13-16). The aim is to obtain a rich, detailed insight into the 'life' of that case and its complex relationships and processes. If using a survey (see Chapter 7), a researcher is"
    },
    {
        "page": "229",
        "text": " 1989) needs adaptation to take account of gender differences (Venkatesh &amp; Morris, 2000). q A study into the business knowledge of IT professionals and its contribution to their relationships with business clients (Bassellier &amp; Benbasat,"
    },
    {
        "page": "149",
        "text": "A case study approach is particularly suited to research into the development, implementation and ongoing use of information systems, because it enables researchers to study all the factors and their inter-relationships (managers, users,"
    },
    {
        "page": "151",
        "text": "5 Does the research look at relationships and processes and provide a holistic perspective? 6 What kind of generalizations are reported, if any? 7 How does the researcher link theory to the case study? 8 What limitations in the case study"
    },
    {
        "page": "19",
        "text": "How does the advent of Internet shopping affect family relationships in the home? Stereotypes suggest women do the weekly grocery shopping, but men are the main technology users, so who does the shopping from an online supermarket?"
    },
    {
        "page": "10",
        "text": "Systematic conduct means that the research tasks are undertaken in a rational fashion, with logical relationships between them; they are not random acts or beliefs somehow cobbled together. This book therefore explains how research can be"
    },
    {
        "page": "318",
        "text": "You can also turn things round and put the audience on the spot rather than yourself, by making clear in your presentation where you are looking for help or advice from the audience. Leaving a set of questions on display as your last slide can"
    },
    {
        "page": "261",
        "text": "So we have (3-1 ) x (2-1 ) = 2 degrees of freedom. Tables of critical values for chi-squared typically show degrees of freedom against probability. Figure 17.10 gives an extract of such a table. Looking down the column for 2 degrees of freedom,"
    },
    {
        "page": "203",
        "text": "Figure 14.1 Different kinds of observation involves looking, but it can involve senses other than sight: hearing, smelling, touching and tasting. For example, a researcher might look at the seating pattern in a group meeting, feel the texture or"
    },
    {
        "page": "95",
        "text": "If you choose a document survey, the relevant documents might already exist, or you might need to create them yourself (see Chapter 16), and you need to decide exactly what you are looking for in the documents. Sampling frame A sampling"
    },
    {
        "page": "285",
        "text": "You could keep on looking at swans, possibly for decades, and always see white swans, so your hypothesis 'must' be true. Perhaps you will build a whole research program that relies on the 'fact' that all swans are white. But what if finally one"
    },
    {
        "page": "237",
        "text": " from the original researchers, using different statistical techniques to look for new correlations or patterns, looking for different themes in qualitative data or applying a different theoretical framework. q Finding out from researchers' field notes"
    },
    {
        "page": "38",
        "text": " data they generate using triangulation. Data analysis After you have generated some data, by using your chosen research strategy and one or more data generation methods, you need to analyse the data, looking for relationships or themes"
    },
    {
        "page": "197",
        "text": "Because they cannot see you nodding your head and looking interested, interviewees may need reassurance from you that they are supplying the kind of information you need. Remember, too, that participants can suddenly disappear - you"
    },
    {
        "page": "268",
        "text": "For an example of such analysis, see Figure 18.1 from a piece of research concerned with looking at the use of metaphors during information systems development. To start with, your choice of categories is not crucial - you'll have plenty of"
    },
    {
        "page": "82",
        "text": "In addition to looking for previously published work on this topic, she also looked at material on e-learning in secondary schools and higher education, for contrast. She thought she wanted to use a case-study approach, so looked at the use of"
    },
    {
        "page": "85",
        "text": "Further detail about the content can be gleaned by looking at the section headings. If you want more information, the first and last sentences of each paragraph are usually those containing that paragraph's key ideas. For a book, there is"
    },
    {
        "page": "61",
        "text": "These codes capture the profession's commitments and responsibilities, to help members make ethical decisions. Even if you are not a paid-up member of any professional body, you can be guided by their codes. It's therefore worth looking up"
    },
    {
        "page": "60",
        "text": " Be an ethical reviewer No unnecessary intrusion Researchers should not intrude unnecessarily into the participants' activities. Before undertaking a piece of research, you must be satisfied that the knowledge you're looking for is not already"
    },
    {
        "page": "278",
        "text": "Analyse three such interviews, looking for: a purely descriptive passages which give us biographical facts for example, age, number of children, years in the business; b themes that are covered in the interviews, for example, latest film,"
    },
    {
        "page": "36",
        "text": "Often involves looking, but it can involve the other senses too: hearing, smelling, touching and tasting. (See Chapter 14.) • Questionnaire: a pre-defined set of questions assembled in a pre-determined order. Respondents are asked to answer"
    },
    {
        "page": "317",
        "text": "Similarly, try not to spend the whole time looking down at your notes, or at the computer screen. Instead, look around the room and maintain eye contact with one person for a few seconds before moving on to another person. If you are really"
    },
    {
        "page": "93",
        "text": "An obvious example is the literature survey, which examines printed and online published documents. The survey strategy is mostly associated with the philosophical paradigm of positivism (see Chapter 19), since it is looking for patterns and"
    },
    {
        "page": "288",
        "text": "It is looking for general laws or patterns, not findings unique to one particular case. The generalizability depends on how representative the research samples were, such as the subjects used in an experiment or the respondents in a survey."
    },
    {
        "page": "45",
        "text": "So there are also research opportunities in looking for new business models which can make money via the Internet. Many people have found that their working lives have been changed by the introduction of email systems. Some find that"
    },
    {
        "page": "291",
        "text": " and design and creation - see Chapters 7-12). It also offers some suggestions on how to decide on the underlying paradigm for your own research project. Interpretivism Let's start by looking at interpretivism (see the definition CXLVIII."
    },
    {
        "page": "145",
        "text": "I carried out four case studies, looking at how some local governments used their websites during the FMD outbreak: the information presented and the different audiences addressed. The data provided empirical evidence for a theory about"
    },
    {
        "page": "44",
        "text": "Many businesses are still looking for Internet models that work financially - that is, a model that enables them to make money from the Internet and not just offer free information. Today people use the Internet for such things as: • buying and"
    },
    {
        "page": "83",
        "text": "For example: • Is it aimed at academics or practitioners? You should concentrate on those aimed at academics. • How long has the journal existed? You can tell this by looking at the volume number: the higher it is, the longer the journal has"
    },
    {
        "page": "221",
        "text": "It's usually worth looking at previously used questionnaires, where you might find questions that you can use or adapt. For example, ISWorld contains a data bank of questionnaires and questions that have been used in previous IS research"
    },
    {
        "page": "103",
        "text": " bulletin boards, chatrooms or messaging services (see Chapter 13); • a set of observations can be made of online communities, looking for, for example, types of comments made or frequencies of postings (see Chapter 14); q a collection of"
    },
    {
        "page": "80",
        "text": "Although lecture material has not been peer reviewed and should not be cited in the literature review, often the course reading list gives you a guide on where to start looking in the literature. However, there are some problems with the Internet"
    },
    {
        "page": "241",
        "text": "Nor can any other data generation method, but the official, authoritative-looking nature of many documents means that researchers sometimes forget this. • Access to some types of documents is expensive or impossible, or, particularly for"
    },
    {
        "page": "27",
        "text": "Try to express each potential topic as a single research question. Now break down what you would need to do to address that question, expressing it as series of objectives you would have to meet. This requires looking at the other chapters in"
    },
    {
        "page": "273",
        "text": "As with textual analysis, you then need to analyse the data looking for themes and patterns. Some researchers treat images as if they are a true representation of some aspect of the real world - for example, photographs are provided to"
    },
    {
        "page": "292",
        "text": "Let's start by looking at interpretivism (see the definition below), its characteristics and how we judge the quality of a piece of interpretive research. Interpre retive research in IS and computing is concerned with understanding the Interpretive"
    },
    {
        "page": "91",
        "text": "The website provides a good discussion of the mistake of citing work just because it has been cited by others, without looking at the original work yourself, and of how such a mistake can be propagated through subsequent literature. (Of course"
    },
    {
        "page": "92",
        "text": "You can learn about literature reviews by looking at examples, particularly those in journals that specialize in review articles such as M/SQ Review (part or MIS Quarterly) and ACM Computing Surveys. Webster and Watson (2002) offer"
    },
    {
        "page": "268",
        "text": "Then you need to work out a system for locating particular segments of data. For example, the location code: Smith-13/1 1/04-12-5 might mean the words said by Smith in an interview on 13 November 2004, found on page 12 and line 5 of the"
    },
    {
        "page": "270",
        "text": "Next, you start to look for themes and inter-connections between segments and categories. You might find it useful to take all the data segments categorized under one theme and see if some pattern is present across all of them. If researchers"
    },
    {
        "page": "329",
        "text": "data generation methods cont. and strategies 37 in surveys 95, 102-3 and triangulation 37-8, 142 data interpretation 208, 262-3 data protection law 55 data security 59, 61, 65 data segments 268-9, 270 data transfer errors 102 Davies, L.J. 181"
    },
    {
        "page": "254",
        "text": "Whatever kind of chart you choose to use make sure that: q It is easy to read. q It has a title. q It gives information about the units represented in the columns of a bar chart or table, the segments of a pie chart or the axes of a graph. q It displays"
    },
    {
        "page": "276",
        "text": " q writing tools - to enable you to write your own notes and self-memos; q visual displays - to show links between data segments; • exporting - to allow you to incorporate your analysis in another software program such as a word-processor."
    },
    {
        "page": "113",
        "text": "What is important is that you use an appropriate combination of text, diagrams, models, mathematics and code segments so that the readers can see how you moved from your initial awareness of a problem to increasing understanding,"
    },
    {
        "page": "273",
        "text": " data segments and a well- ordered filing system. As with textual analysis, you then need to analyse the data looking for themes and patterns. Some researchers treat images as if they are a true representation of some aspect of the real world"
    },
    {
        "page": "157",
        "text": "Once under way, an action research project is not completely under the control of the researchers - events in the problem situation may disrupt their plans, which must therefore be flexible and adaptable. Nevertheless, the action research"
    },
    {
        "page": "136",
        "text": "Experiments involving computer programs that run over the Internet are, however, difficult because the Internet is not under the control of the researcher - connections, network availability, upload and download speeds, and so on. A researcher"
    },
    {
        "page": "158",
        "text": "Consultants operate under tighter time and budget restraints. You need to be clear at the start of a project whether you are undertaking action research or consultancy. Papers submitted to research journals are rejected if they look as though"
    },
    {
        "page": "74",
        "text": "'Refereed' means that articles have been 'peer reviewed': academics unknown to an article's authors assess its suitability and quality before a decision is taken on whether to publish it in the journal. (Look at a journal's website under"
    },
    {
        "page": "130",
        "text": "This approach tries to ensure people don't influence the results because of their expectations. When testing a new drug, medical researchers make sure that neither the researchers nor the patient subjects know who is receiving the drug under"
    },
    {
        "page": "238",
        "text": "For all statistics you should ask: q Whether counting and measuring the object under investigation is easy and straightforward. For example, counting the population of a country may be hampered by unknown numbers of homeless people and"
    },
    {
        "page": "176",
        "text": "Instead, the role of the ethnographer is to examine the symbolic forms used by the people under study (words, images, institutions, rituals, behaviours) and analyse them with respect to one another and to the whole culture that they comprise"
    },
    {
        "page": "51",
        "text": "Just as the law about the Internet is still being developed, codes of conduct for doing ethical Internet research are still under discussion. Ethics committees normally want to see that researchers have obtained informed consent from any human"
    },
    {
        "page": "155",
        "text": "They are concerned with doing things that make a difference, and learning about how they effected the change. q Collaboration with practitioners: people living and working in the situation under study are active participants in the research. q"
    },
    {
        "page": "270",
        "text": "You might find it useful to take all the data segments categorized under one theme and see if some pattern is present across all of them. If researchers are using hard copies of the data, they often literally cut and paste together all the segments"
    },
    {
        "page": "146",
        "text": "For example, there is a substantial amount in the literature about technology acceptance - under what circumstances a new IT-based system will be accepted by the users, building on Davis' (1989) technology acceptance model. A case study"
    },
    {
        "page": "128",
        "text": "Experiments are typically repeated many times, and under varying conditions, to be certain that the observed/measured outcomes are not caused by some other factor, for example, faulty equipment. Warning: Terms and definitions Note that a"
    },
    {
        "page": "142",
        "text": " between phenomenon and context are not clearly evident. (Yin, 2003b) A case study is characterized by: q Focus on depth rather than breadth: the researcher obtains as much detail as possible about one instance of the phenomenon under"
    },
    {
        "page": "141",
        "text": " detailed insight into the 'life' of that case and its complex relationships and processes. If using a survey (see Chapter 7), a researcher is able to take a wide but only shallow view of lots of instances of the phenomenon under investigation and"
    },
    {
        "page": "145",
        "text": "Generalizations Some people criticize case studies for producing knowledge that only relates to the case under study. However, it is possible to generate broader conclusions that are relevant beyond the case itself, known as generalizations."
    },
    {
        "page": "140",
        "text": "Keeping mum as the project goes under: Towards an explanatory model. Journal of Management Information Systems, 18(2), 189-227. Tichy, W.F. (1998). Should computer scientists experiment more? IEEE Computer, 3 1(5), 32-40. Zendler"
    },
    {
        "page": "94",
        "text": "The planning and conducting of surveys can be broken down into six different activities under the following headings: data requirements, data generation method, sampling frame, sampling technique, response rate and non-responses,"
    },
    {
        "page": "104",
        "text": "Yetton, Martin, Sharma and Johnston (2000) use two postal surveys to investigate critical success factors for systems projects under development (that is, before implementation). They analyse the data obtained to argue that successful project"
    },
    {
        "page": "208",
        "text": "In participant observation, the researcher takes part in the situation under study, so that it can be experienced from the point of view of the others in that setting. This can be overt - people know that you are carrying out research into what they"
    },
    {
        "page": "116",
        "text": "The prototype's purpose is to show that the researcher's design solution has certain properties or that, under certain conditions, it behaves in a particular way. For example, if previously it was not known whether a particular process could be"
    },
    {
        "page": "287",
        "text": " in our own research. We have to judge the quality, or soundness, of their research, often called the validity of the research. Criteria for assessing the quality of positivist research can be placed under four headings: objectivity, reliability,"
    },
    {
        "page": "iv",
        "text": "Briony J. Oates 2006 First published 2006 Apart from any fair dealing for the purposes of research or private study, or criticism or review, as permitted under the Copyright, Designs and Patents Act, 1988, this publication may be reproduced,"
    },
    {
        "page": "119",
        "text": "It may not matter if a piece of digital art is a bit flaky and prone to crashing under certain conditions. Nor is it likely that someone else will need to come along and modify a piece of digital art in the future, so thorough documentation is less"
    },
    {
        "page": "92",
        "text": "Ned Kock (1999) discusses what happened and the difficulties he faced when he published some research in a journal and later discovered a plagiarized copy of the article had been submitted under another author's name to another journal."
    },
    {
        "page": "143",
        "text": "Warning: Definition of terms Some people confuse case study research with case study teaching. Case study teaching is used in some disciplines, for example, business studies, where students study a particular instance and analyse what"
    },
    {
        "page": "261",
        "text": "For example, a teacher might want to compare the results of a class of students where they have tried a new teaching method, with those of the previous year's class, taught the old way. Perhaps this year the mean is 66 and last year it was 62."
    },
    {
        "page": "129",
        "text": "For example, the introduction of a new teaching and learning approach might lead to improved examination results. This could be investigated via an experiment, where the independent variable is the new approach and the dependent"
    },
    {
        "page": "227",
        "text": " way a course had been taught, you would need to make sure you asked questions about all the approaches to teaching that had been used: lectures, seminars, laboratory-based practical work, computer-based support systems, and so on."
    },
    {
        "page": "135",
        "text": "Some possible designs include: q One group, pre-test and post-test: the participants' performance is measured (for example, data modelling ability), the researchers then apply some treatment (for example, a new method of teaching data"
    },
    {
        "page": "17",
        "text": "Is it possible to develop a computer-based tool to support online discussions for teaching purposes? • Is it possible to effectively render the texture of an animal's hair in a virtual zoo? Often the computer system developed is of use to someone"
    },
    {
        "page": "46",
        "text": "Its information and communication technologies also enable new types of play, such as online games, new ways of communication, such as blogging (online diary-writing), and new means of teaching, such as distance learning. All of these"
    },
    {
        "page": "xvi",
        "text": "Instructors and lecturers If you are teaching a course in research methods for IS and computing, this book can be an appropriate course text. I have used the material to teach both undergraduates and postgraduates. The chapters average"
    },
    {
        "page": "26",
        "text": "q 'Computer-based teaching means the end of universities as we know them.' q 'Everyone knows that object-oriented is much better than structured analysis.' • 'Open source software is the future.' Brainstorming and clustering It is often helpful"
    },
    {
        "page": "80",
        "text": "You may also find that lecturers have put their teaching notes on the web. Although lecture material has not been peer reviewed and should not be cited in the literature review, often the course reading list gives you a guide on where to start"
    },
    {
        "page": "259",
        "text": "In other words, we need a test for statistical significance - are our results worth being taken seriously? Researchers start off with the assumption that there is no relationship - any apparent link is a fluke. This is called the null hypothesis - we"
    },
    {
        "page": "282",
        "text": " 'proof by demonstration' (see Chapter 8), you may therefore be able to ignore this chapter. However, if you want to cite previous research studies based on strategies other than design and creation, you have to be able to evaluate their worth"
    },
    {
        "page": "61",
        "text": "These codes capture the profession's commitments and responsibilities, to help members make ethical decisions. Even if you are not a paid-up member of any professional body, you can be guided by their codes. It's therefore worth looking up"
    },
    {
        "page": "217",
        "text": "Participant observation is often associated with ethnography (see Chapter 12), so texts on that strategy are also worth consulting, for example, Geertz (1973), Hammersley and Atkinson (1983) and Van Maanen (1988). Mann and Stewart"
    },
    {
        "page": "18",
        "text": "Good research could provide the evidence that would inform developers about which new ideas are worth taking up and which are not. Similarly, business managers are sometimes accused of blindly following the latest management fad and"
    },
    {
        "page": "240",
        "text": "One problem in analysing Internet-based documents is their transitory nature - often the next time you try to visit a site it's changed, or disappeared entirely. It's worth making a copy of the webpages you are researching, so that you can look at it"
    },
    {
        "page": "41",
        "text": "Analyse one complete volume of it (that is, a year's worth of articles) to see which research strategies and data generation methods are used, and how often. Does one type predominate? Decide whether you would prefer to: a follow the"
    },
    {
        "page": "112",
        "text": "A new approach in digital art might require the development of an art portfolio tracing the development of the artist's creative ideas. q Evaluation examines the developed artefact and looks for an assessment of its worth and deviations from"
    },
    {
        "page": "83",
        "text": "To access articles more quickly it's often worth trying the web, since many authors put a copy of their journal articles and conference papers on their university's staff web- pages. If you know the university where they work, these can usually be"
    },
    {
        "page": "221",
        "text": "It's usually worth looking at previously used questionnaires, where you might find questions that you can use or adapt. For example, ISWorld contains a data bank of questionnaires and questions that have been used in previous IS research"
    },
    {
        "page": "27",
        "text": "If they do, this would be interesting and worth further investigation. But if they do not, the result is not particularly interesting. A better research topic, with useful outcomes whatever they are, would be to investigate what factors contribute to"
    },
    {
        "page": "47",
        "text": "Table 4.1 summarizes some of the possibilities and limitations of basing each of these strategies on the Internet, and Chapters 7-12 discuss the topic in more detail. The book also looks at four data generation methods: interviews, observations"
    },
    {
        "page": "246",
        "text": "This chapter summarizes some techniques available for quantitative data analysis and indicates when and how they can be used. It should help you to employ tables and charts to visualize your data, use appropriate means to describe it, and"
    },
    {
        "page": "140",
        "text": "Finally, Reips (2002) summarizes what is known so far about the conduct of Internet-based experiments, and gives recommendations on how they can be used effectively. References Fencott, C, van Schaik, P., Ling, J., &amp; Shafiullah, M. (2002)."
    },
    {
        "page": "104",
        "text": "They analyse the data obtained to argue that successful project management depends on a project team being stable, experienced and cohesive, and having effective management of risk, senior management support and active user"
    },
    {
        "page": "237",
        "text": "For example, Cord and Thompson (2004) cite a study in 1991 that found that 90 per cent of qualitative data from academic research was either lost or at risk - sitting in researchers' homes or offices, inaccessible to others and likely to be lost"
    },
    {
        "page": "268",
        "text": "Don't risk spoiling or harming your original data in any way. Of course, if you're doing data analysis with the aid of a computer, you will need to keep backups of your analysis work too. Data analysis Start off by reading through all of your data"
    },
    {
        "page": "338",
        "text": " 137, 138 see also generalization; non-representativeness research 6Ps (see paradigm; participants; presentation; process; products; purpose) definition 7 and law 55 meaning of 4-7, 14 philosophies 7 and risk 114 research instruments 287"
    },
    {
        "page": "190",
        "text": "Similarly, interviewees should not normally be expected to make themselves available for more than two hours - if you know you will need longer, arrange to have a series of shorter interviews, otherwise you risk tiring and annoying your"
    },
    {
        "page": "228",
        "text": "The longer the web questionnaire takes to complete, the greater the risk of the respondents' network connections going down. If their work so far is lost, they will probably give up rather than start again. Email questionnaires can be completed"
    },
    {
        "page": "304",
        "text": " how you perceive our world and what kind of knowledge you want to create; • whether you want to do the kind of research that is typically done in your discipline; • whether you are willing to take a risk and want to challenge the status quo."
    },
    {
        "page": "225",
        "text": " come off the fence and answer more definitely, but risk alienating those respondents who genuinely don't know. Be careful also with the boundaries between points on a scale. For example, what is wrong with the following? What is your age"
    },
    {
        "page": "114",
        "text": " on the risky and uncertain areas, because if the uncertainties are successfully tackled, it will lead to new knowledge. You can therefore claim to be doing research rather than 'normal' design and creation through the novelty and risk-taking of"
    },
    {
        "page": "209",
        "text": "You will probably need to obtain permission to research into your own organization, from both your bosses and colleagues - you do not want to risk losing your job if they find out only by accident. You must also somehow make yourself aware"
    },
    {
        "page": "214",
        "text": "q Robinson and Sharp (2003) used observation in an ethnography based in a small company that used XP to develop web-based intelligent advertisements. They investigated whether the 12 practices of XP give rise to a culture that embodies"
    },
    {
        "page": "45",
        "text": "However, the rise of the Internet and web has also led to some undesirable outcomes. Parents worry about what their children might find on the web, and what undesirable people might be taking part in chat rooms intended for youngsters."
    },
    {
        "page": "43",
        "text": "In this chapter you will learn about: the rise of the Internet and World Wide Web; some possible research topics on the Internet and web; using the Internet within a literature review; using the Internet to support research strategies and data"
    },
    {
        "page": "19",
        "text": "Evidence is being gathered about the rate of climate change to help us determine what might happen (for example, a rise in sea levels), and how soon, so that we can take action to cope with or even alter the predicted course of events."
    },
    {
        "page": "5",
        "text": "Returning to our tyre puncture example, you probably would not bother to contact every tyre fitter listed in the telephone directory - life is too short! Nor would you Everyday thinking is often characterized by: Good academic research is"
    },
    {
        "page": "4",
        "text": "In fact we all do research every day - research is a particular kind of everyday thinking. Let's use an example. Supposing you come out to your car one day and discover you have a flat tyre. You need to get the punctured tyre repaired, or buy a"
    },
    {
        "page": "6",
        "text": " As judged by the users of the research Figure 1 .2 Everyday thinking versus good research adopt a very systematic approach, for example by telephoning every third fitter in the directory. You would telephone two or three, and that would do."
    },
    {
        "page": "51",
        "text": " and downloading material from it would be illegal - and saying you were doing it for research purposes would not be a satisfactory defence. In some countries just accessing the Internet is illegal. In every country, the law about the Internet"
    },
    {
        "page": "313",
        "text": "Some set themselves a target: 1500 words every day, or 500 words before they're allowed a cup of coffee. Others might not produce anything for a week, but when inspiration strikes they write for hours in a continuous flow. Write in the way that"
    },
    {
        "page": "xvi",
        "text": "Use the evaluation guides provided in almost every chapter to help you analyse and evaluate the research of others, particularly the work you read as you study the previous literature in your discipline. Once you have decided your research"
    },
    {
        "page": "97",
        "text": "For example, if using the telephone directory, you might decide to choose every 100th person. Note that researchers using this technique would not start with the first person in the directory but would choose the first name at random and then"
    },
    {
        "page": "30",
        "text": "Every suggestion should be written down, however silly it sounds. Continue until you have filled the page/board or have no more ideas ( 1 5 minutes to I hour). b Look through the list, cluster related ideas together, remove those that do not"
    },
    {
        "page": "80",
        "text": "Try to be disciplined: don't follow up every link unthinkingly, bookmark sites that look relevant and come back to them later. It is also a good idea to restrict yourself to, say, an hour of web surfing before coming offline and working on what you"
    },
    {
        "page": "102",
        "text": "If you ask every 100th visitor to a website to complete a questionnaire, for example, this is a form of probabilistic, systematic sampling. If a questionnaire is returned electronically, the researcher gains the further advantage that the data is"
    },
    {
        "page": "127",
        "text": "attention to the many variables that could affect my journey, and so I am not justified in saying that my new route caused my shorter journey time. In academic research, an experiment is a strategy that investigates cause and effect relationships"
    },
    {
        "page": "132",
        "text": "Instrumentation: faulty instruments used to measure the dependent variable will affect the results. This could be inaccurate measuring devices, or interviewers becoming more bored, or more practised, with experience. q Experimental mortality:"
    },
    {
        "page": "129",
        "text": "The independent variable affects one or more dependent variables: its size, number, length or whatever exists independently and is not affected by the other variable. A dependent variable changes as a result of changes to the independent"
    },
    {
        "page": "126",
        "text": " on the radio warning of possible disruptions on my route and advising drivers to take a different road? Academic researchers would therefore criticize my experiment because I had not paid attention to the many variables that could affect my"
    },
    {
        "page": "40",
        "text": "4 Do the researchers indicate their criteria for judging the success or usefulness of their work? 5 Is there a clear process summarized, from the original motivation and literature review through to final outcome(s)? If not, how does that affect your"
    },
    {
        "page": "35",
        "text": "There is 'before' and 'after' measurement, and all factors that might affect the results are carefully excluded from the study, other than the one factor that is thought will cause the 'after' result. (See Chapter 9.) • Case study: focuses on one"
    },
    {
        "page": "17",
        "text": "Knowing about this is probably not going to affect the current government's educational policy, or suggest new uses for computers. But exploring and finding out the answers to questions is part of what makes us human, so it is natural that"
    },
    {
        "page": "164",
        "text": "For example, Kock, McQueen and Scott (1997) discuss an action research study that investigated the thesis that 'groupware systems would positively affect productivity and quality of project- related activities'. This kind of action research would"
    },
    {
        "page": "215",
        "text": "If not, how does this affect your confidence in the research? 3 Do you think the items observed were easily observable, unambiguous and independent from each other? Did they occur regularly enough to provide sufficient data, but without"
    },
    {
        "page": "300",
        "text": " structures. Research is aimed at understanding people in their worlds, not in the artificial world of a laboratory. Ethnographers recognize that their own background, beliefs and actions will shape the research process and affect the"
    },
    {
        "page": "220",
        "text": "interviews, considering especially how your appearance and interactions with your interviewees might affect the responses they give you. Questionnaires are widely used in research because they provide an efficient way of collecting data"
    },
    {
        "page": "36",
        "text": "He realized each strategy would help him address a different research question associated with his main topic: • Case study: What issues in Company X affect the use of Intranets by those working in the Personnel Department? • Survey: Are"
    },
    {
        "page": "150",
        "text": " credibility. q It can be difficult and time-consuming to negotiate access to the necessary settings, people and documents. • The presence of the researcher can affect how people ISO Researching Information Systems and Computing LXXVIII."
    },
    {
        "page": "313",
        "text": "Make sure, for example, that you know the difference between: where/were, affect/ effect, there/their, it's/its, practice/practise. Your assertions and conclusions should always be supported by evidence; they should not appear as if from"
    },
    {
        "page": "106",
        "text": "Now brainstorm: what factors might affect whether or not people do use the web and/or communicate with others online? Are some groups more likely than others to find it difficult or impossible? How could you research whether your lists (of"
    },
    {
        "page": "56",
        "text": "You should accept their decision, and not try to force them by wheedling or threats. Their non-participation may affect your ability to complete your research, but that's your problem, not theirs. This f 56 Researching Information Systems and"
    },
    {
        "page": "241",
        "text": "an analysis of electronic textbooks on the web, assessing how appearance and design can affect users' sense of engagement (Wilson, Landoni, &amp; Gibb, 2003); • studies of how websites are used as tools for self-representation (Scale, 2001;"
    },
    {
        "page": "151",
        "text": "The presence of the researcher can affect how people behave so that you end up not being able to study what you wanted to. q There are no set rules to follow and you cannot know in advance whether you are naturally any good at it. Use the"
    },
    {
        "page": "19",
        "text": "How does the advent of Internet shopping affect family relationships in the home? Stereotypes suggest women do the weekly grocery shopping, but men are the main technology users, so who does the shopping from an online supermarket?"
    },
    {
        "page": "292",
        "text": "Language and shared meanings differ across groups and over time. q Researcher reflexivity: researchers are not neutral. Their own assumptions, beliefs, values and actions will inevitably shape the research process and affect the situation."
    },
    {
        "page": "68",
        "text": "If not, how does that affect your confidence in the research? 2 Do the researchers tell us of any ethical dilemmas they faced and how they resolved them? 3 Are there additional ethical issues you think the researchers would have needed to"
    },
    {
        "page": "165",
        "text": "This means that at least four different types of knowledge can emerge from action research: experiential, presentational, propositional and practical (Heron, 1996): • Experiential knowledge: gained by direct encounter; almost impossible to put"
    },
    {
        "page": "242",
        "text": "3 Try to keep a copy of all the documents you handle during the next week (memos, emails, shopping till receipts, travel tickets, and so on). What could a future historian learn about you and your life from these documents? Study a piece of"
    },
    {
        "page": "234",
        "text": "Individuals also produce and use documents, such as: • personal papers and communications, for example, diaries, logs, letters, phone texts and emails; q documents from our everyday lives, for example, bus tickets, shopping lists, till receipts"
    },
    {
        "page": "176",
        "text": "q Ethnographers from the holistic school say that the researchers must have empathy and identification with the group being observed, that is, they should 'go native' and live like the local people (for example, Evans-Pritchard, 1950). If they do"
    },
    {
        "page": "297",
        "text": "Characteristics of critical research The critical research paradigm in IS has been dominated by the work of the 'Frankfurt School' of philosophers and especially by one of its members, Habermas. Other critical philosophers, not in the Frankfurt"
    },
    {
        "page": "282",
        "text": "This shared way of thinking is reflected in the research strategies used and accepted as appropriate in a particular research community. L-/l£lrl|ll\\lll J JWU\\J&lt;&gt; A scholarly school of thought's ontology comprises its members foundational"
    },
    {
        "page": "175",
        "text": "Here we'll briefly look at three of them: the holistic, semiotic and critical schools (Harvey &amp;C Myers, 1995; Myers, 1999 [citing Sanday, 1979]). q Ethnographers from the holistic school say that the researchers •/ Ethnography I75J XCII."
    },
    {
        "page": "331",
        "text": "framework 156-7, 159, 160 Frankfurt School 297 Gaskell, G. 243 gateways, academic 78-9 Geertz, C. 176, 183, 217 generalization in action research 161 in case studies 145-6 in design and creation 114 in ethnography 177, 178 in"
    },
    {
        "page": "307",
        "text": "Mingers, J. (2003). The paucity of multimethod research: A review of the information systems literature. Information Systems Journal, 13(3), 233-249. Mumford, E. (1983). Designing human systems. Manchester: Manchester Business School."
    },
    {
        "page": "328",
        "text": " 208, 210-11,212,236 credibility 294-5 critical analysis, as research product 24 critical ethnography school 176, 178 critical evaluation, in conducting literature reviews 85 critical research and action research 156, 301 and case studies 142,"
    },
    {
        "page": "330",
        "text": " 120 Fitzgerald, B. 14, 305 Forrester, P.L. 167 found documents 233, 236, 237-8, 239-40 Fowler, F.J. 106 fractiles 257 framework 156-7, 159, 160 Frankfurt School 297 Gaskell, G. 243 330 Researching Information Systems and Computing."
    },
    {
        "page": "76",
        "text": "For example, the number of people with Internet access: does it include those with a PC at home, and also those who access the Internet from school or from their place of employment? What about those who use a friend's PC, or an Internet"
    },
    {
        "page": "126",
        "text": " the school holidays, so there was less traffic on the roads? Had an accident occurred on a road feeding into my route, so fewer cars were able to join my route? Had there been an item on the radio warning of possible disruptions on my route"
    },
    {
        "page": "17",
        "text": "For example, right now someone might be studying patterns of Sunday School attendance in 18th-century England or 19th-century Virginia. Knowing about this is probably not going to affect the current government's educational policy,"
    },
    {
        "page": "338",
        "text": " 303 self-plagiarism 62-3 self-presentation 319-20 self-selection sampling 98 semantic differential scale 224 semi-structured interviews 188, 197 semiotic analysis 239 semiotic ethnography school 176 Senn, J. 14 sensitive information 187,"
    },
    {
        "page": "182",
        "text": "4 Does the work seem to belong to the holistic, semiotic or critical school? 5 Is the ethnography a standalone description, or is it linked to theory, other ethnographies or issues in the researcher's own culture? 6 Does the paper include an"
    },
    {
        "page": "xviii",
        "text": "I wish to thank students and colleagues in the School of Computing, University of Teesside, Middlesbrough, UK. They have used and commented upon much of the material in this book, and helped me refine it. I also want to thank Linda"
    },
    {
        "page": "320",
        "text": " are you working on?' • 'I've just heard an interesting presentation on  . Were you there?' • 'What did you think of this morning's keynote talk?' • 'I see you're from X University. Do you know Y who works in the Business School there?"
    },
    {
        "page": "30",
        "text": "(Remember students have home and social lives, as well as their university-based lives, you could take 'students' to be at school or university, or 'lifelong learners', and IT could cover digital communications, such as mobile phones, as well as"
    },
    {
        "page": "174",
        "text": " mundane aspects of social life, recognizing that even 'normal' groups have their own particular codes of behaviour and ways of seeing the world, and have studied, for example, life in a school classroom or in an air traffic control department."
    },
    {
        "page": "139",
        "text": "2 Study the following statements and decide which ones are falsifiable and could therefore be used as hypotheses: a It always rains on the first day of the school holidays. b Women are better at multi-tasking than men. c Either it is sunny or it is"
    },
    {
        "page": "124",
        "text": "Manchester: Manchester Business School. Murray, J. (1998). Hamlet on the holodeck: The future of narrative in cyberspace. Cambridge, MA: MIT Press. Orlikowski, W.J., &amp; lacono, C. (2001). Desperately seeking the 'IT' in IT research - A call to"
    },
    {
        "page": "7",
        "text": "This book will therefore explain these different philosophies of research (see especially Chapters 19 and 20). The fact that there is more than one school of thought in IS and computing about what constitutes good research makes research in"
    },
    {
        "page": "107",
        "text": "Boston, MA: Harvard Business School. Newsted, P., Chin, W., Ngwenyama, O., &amp; Lee, A. (1996). Resolved: Surveys have outlived their usefulness in IS research (panel). In International Conference on Information Systems, Cleveland, OH,"
    },
    {
        "page": "38",
        "text": "Interview data about recollections of a meeting and company minutes of the same meeting, for example, are two different 'stories', created by different people for different audiences. Interpretivists would not always expect to see convergence in"
    },
    {
        "page": "190",
        "text": " such as body language. Occasionally, an interviewee might refuse you permission to make notes during an interview - you must, of course, respect their wishes, but write up your recollections as best you can later. It's not easy to write notes,"
    },
    {
        "page": "28",
        "text": "For example, it would be foolish for a student with poor programming skills to take on a highly technical project, just as someone with poor interpersonal skills would be ill-advised to take on research involving a lot of interviewing. I Does the"
    },
    {
        "page": "124",
        "text": "It aims to develop and support research education and training in art, design and media and to encourage debate about research skills, methods and approaches (www.biad.uce.ac. uk/research/rti/). Its website includes an online journal,"
    },
    {
        "page": "198",
        "text": " and build on social skills that many researchers already have. q The researcher can check the informant is the appropriate person to be answering the questions. q They are flexible - the researcher can adjust a line of inquiry as the interview"
    },
    {
        "page": "339",
        "text": "Briony J Oates. Silverman, D. 279 single case study 137, 144, 274 Skoldberg, K. 306 Smith, G. 108, 123 Smith, H.J. 137 snowball sampling 98 social cues, and online interviews 50, 196 social problems, and action research 154-5 social skills"
    },
    {
        "page": "209",
        "text": "You may need to be of the right sex and age, and you may need particular skills and qualifications. For example, many readers of this book could quickly acquire the skills to participate as a supermarket shelf-stacker or car park attendant, but"
    },
    {
        "page": "151",
        "text": "List the skills that the successful candidate will need to possess. How could you find out at the interview whether each candidate has them? If no candidate possesses all the necessary skills, for which ones would it be possible to provide"
    },
    {
        "page": "165",
        "text": " knowing 'how to' exercise a skill (note this is different from Kemmis' use of 'practical', discussed above). The 'plurality of knowing' issue therefore challenges action researchers to include emotional, intuitive and artistic skills in their work and"
    },
    {
        "page": "227",
        "text": " test might be designed to assess students' reasoning skills, but might really measure how quickly they can read. To test construct validity, it may be necessary to correlate responses against other responses in the questionnaire or other"
    },
    {
        "page": "21",
        "text": "Not a finished picture, of course; a picture that is still growing in scope and detail with the application of new techniques and new skills. The old scientist cannot claim that the masterpiece is his own work. He may have roughed out part of the"
    },
    {
        "page": "162",
        "text": "We can't stand outside our world as dispassionate observers, we're necessarily already acting in it, forming relationships as we live and breathe. The aim of the new action research is therefore to support and enhance skills for being-in-the-"
    },
    {
        "page": "122",
        "text": "Disadvantages of the design and creation research strategy include: q You may be challenged to justify why your work is not just 'normal' design and creation. q It is risky if you do not have the necessary technical or artistic skills. Enthusiasm is"
    },
    {
        "page": "132",
        "text": "For example, someone tested for speed of data input might subsequently decide to undertake keyboard skills training, and show a much better result in later tests. Participants also often want to help the researcher, or to look good, and so try to"
    },
    {
        "page": "195",
        "text": " a focal position. If you decide to hold group interviews, all of the issues discussed in the previous section still apply. You will also have to have skills for facilitating a group discussion and ensuring that everyone is heard (see the box below)."
    },
    {
        "page": "109",
        "text": "For such projects to be considered as research, rather than only an illustration of technical prowess, they should demonstrate not just technical skills but also academic qualities such as analysis, explanation, argument, justification and critical"
    },
    {
        "page": "332",
        "text": " 95, 102, 228-9 and research strategies 48-9 as research topic 45-7 and surveys 48, 50, 95, 102-3, 104 Internet Archive 240, 243 interpersonal relationships, and interviews 191-2, 195, 196, 198 interpersonal skills 104, 192-4, 195, 197, 198,"
    },
    {
        "page": "130",
        "text": "Eliminate the factor from the experiment: for example, if students are to be used as subjects in an experiment about how people can be helped to learn programming skills, it might be necessary to exclude from the study any students who have"
    },
    {
        "page": "199",
        "text": "They require good social skills and tact, otherwise they can be stressful and upsetting for both the interviewee and the researcher. • Because of the time and effort involved, they are not usually suitable for circumstances where you want to"
    },
    {
        "page": "20",
        "text": "Alternatively, others argue that computer games are beneficial because they hone perception and motor skills and reaction times. Can we test these theories? To come up with a better way Sometimes a research question appears to have"
    },
    {
        "page": "217",
        "text": "The classroom observer: Developing observation skills in early childhood settings (3rd ed.). New York: Teachers College Press. Coghlan, D., &amp; Brannick, T. (2004). Doing action research in your own organization (2nd ed.). London: Sage."
    },
    {
        "page": "46",
        "text": "Web developers also require new skills, such as graphic design and the ability to organize unstructured data. So research is needed into the best methods for designing web systems. Artists are also exploring the possibilities of Internet art"
    },
    {
        "page": "310",
        "text": "Writing is as much a part of the research as all the other skills and strategies discussed in this book. Only by repeatedly writing, showing your work to others and rewriting will you become good at it. Often the literature review can be written"
    },
    {
        "page": "26",
        "text": "You might know someone who asks you to use your IT skills to develop an IT product for their organization. Be careful though, to make sure you can identify an academic research aspect to such work, and that it does not just call for the use of"
    },
    {
        "page": "104",
        "text": "Replication of studies is an essential part of the scientific method (see Chapter 19). • Surveys via postal or web questionnaire, observations or documents are suited to people who do not have good inter-personal and communication skills."
    },
    {
        "page": "152",
        "text": "to provide training before the successful applicant starts the research? Are there some skills which can't be taught? Practise analysing and evaluating research based on a case study strategy. Study a piece of research that used a case study."
    },
    {
        "page": "114",
        "text": "As explained earlier, a research project based on design and creation should demonstrate not just technical skills, but also academic qualities such as analysis, explanation, argument, justification and critical evaluation, and it must also create"
    },
    {
        "page": "121",
        "text": "evaluate the concept via 'proof by demonstration': they have developed an instantiation that supports semantic bookmarks, and they discuss its use by just four users accessing three websites. • Petinot et al. (2004) describe an instantiation."
    },
    {
        "page": "136",
        "text": "Experiments involving computer programs that run over the Internet are, however, difficult because the Internet is not under the control of the researcher - connections, network availability, upload and download speeds, and so on. A researcher"
    },
    {
        "page": "331",
        "text": " 236, 237 graphs 252-4 Greene, R. 52, 123 grounded theory 38, 101-2, 147, 197, 274-6, 279 group interviews 194-5 group think, in action research 160-1 Grusin, R. 123 Cuba, E.G. 293, 294-5, 298 Hall, H.K. 265 Hammerlev, M. 183,217 Hart"
    },
    {
        "page": "328",
        "text": " 300 evaluating 305 and grounded theory 276 and IS (information systems) research 304 overview 296—7 quality of research criteria 298-9 and surveys 93 critical reviews, writing 86-9 Cryer, P. 30 culture 66-7, 197 see also anthropology;"
    },
    {
        "page": "330",
        "text": "empirical assessment of systems, in computing research 2-3, 14, 18 empirical testing, in experiments 128-9 empowerment 296, 297, 298, 300, 303 encryption software 55, 65 end-users see users epistemology 282, 287 error, in data transfer"
    },
    {
        "page": "334",
        "text": " quantitative data analysis Gates, B.J. 24, 145, 170 objectivity documents 238, 241 and ethnography 174, 178, 182 interviews 198 and philosophical paradigms 284, 286, 287, 293, 298 quantitative data analysis 263 of questions 222 O'Brien,"
    },
    {
        "page": "336",
        "text": "194 power in critical research 296, 297, 298, 300-1,303 in group interviews 195 and participation 57, 60, 66, 160, 163 practical knowledge 165 practical outcomes 163-4, 166 practical problems 155—6 practitioner-researchers 208, 211, 214"
    },
    {
        "page": "333",
        "text": " K.H. 229 Lincoln, Y.S. 293, 294-5, 298, 305-6 line graphs 252, 253, 254 Linux operating system 17 list questions 224 literature reviews case study 82 conducting assessing 83-4 critical evaluation 85 obtaining 83 reading 84-5 recording 82,"
    },
    {
        "page": "338",
        "text": "references cont. and plagiarism 62, 89-90, 92 recording 83, 85-6 reflexive-practical outcomes 163-5 reflexivity 178-9, 210, 212, 292-3, 298, 300 refutation 285 Reips, U.-D. 140 Reithel, B.J. 103 relational praxis 162-3 relevance 10, 14 reliability"
    },
    {
        "page": "326",
        "text": " 198 ASA (American Sociological Association) 62 assessing, in conducting literature reviews 83-4 association 299-300 Atkinson, P. 183,217 audio tape recordings 191, 193-4, 195, 267-8, 273, 274 authenticity, in critical research 298 authors"
    },
    {
        "page": "327",
        "text": " quantitative data 268-70, 275, 287 cause and effect 105, 127, 136, 137, 288, 293-1, 299 Cegielski, C.G. 103 Cellan-Jones, R. 52 CERN (European Laboratory for Particle Physics) 44, 52 change 155, 158, 164-5, 168, 298, 301 charts 250-2,"
    },
    {
        "page": "338",
        "text": " 215, 227, 238, 287-8, 293 repeatability experiments 127, 133, 299 and interpretivism 293 questionnaires 227 and scientific method 285, 287, 288 surveys 104 reports, in literature reviews 75-6, 79 representativeness 48, 96-7, 100, 104, 137,"
    },
    {
        "page": "339",
        "text": " 133, 137,160 subjectivity 178, 292 subjects 56, 64-5 Suh, W. 240 summaries, in literature reviews 85, 86 supervisors 28, 29, 79, 160, 314 surveys and association 299-300 in computing research 94, 104 defining 93—4 and documents 235-6"
    },
    {
        "page": "336",
        "text": " 150, 152, 301 characteristics 286 and computing research 93, 304 criticisms 288-9 and design and creation 302, 303 and experiments 284-5, 286, 299 and grounded theory 276 and IS (information systems) research 304 and objectivity 284"
    },
    {
        "page": "331",
        "text": " 137, 299 and external validity 132-3, 137, 288 in Internet research 48 and interpretivism 294 in interviews 188, 199 in observation 215 in research process model 39 in surveys 96, 97-8, 100 and uniqueness 96, 97, 288-9 Gibb, F. 241 Gillies,"
    },
    {
        "page": "330",
        "text": " 284-5, 286, 299 independent and dependent variables 127, 129, 130, 131, 134-5 internal validity 131-2 observation 127, 130-1 quasi- or field experiments 133—4, 136 uncontrolled trials 134 and positivism 284-5, 286, 299 quantitative data"
    },
    {
        "page": "x",
        "text": "Alternative Philosophical Paradigms 291 Introduction 291 Interpretivism 292 Critical research 296 Linking research strategies to philosophical paradigms 299 Which paradigm to choose? 303 Evaluating interpretive and critical research 305"
    },
    {
        "page": "326",
        "text": " in literature reviews 76 artificiality 133-4, 137, 141-2, 198 ASA (American Sociological Association) 62 assessing, in conducting literature reviews 83-4 association 299-300 Atkinson, P. 183,217 audio tape recordings 191, 193-4, 195, 267-8,"
    },
    {
        "page": "327",
        "text": " 83 categorical data 247 categorization, quantitative data 268-70, 275, 287 cause and effect 105, 127, 136, 137, 288, 293-1, 299 Cegielski, C.G. 103 Cellan-Jones, R. 52 CERN (European Laboratory for Particle Physics) 44, 52 change 155,"
    },
    {
        "page": "337",
        "text": " 105, 131, 237, 245, 246-8 quantitative data analysis data coding 248-9 data types 246-8, 266 defining 245-6 documents 239 evaluating 263-4 and grounded theory 274-6 interpretation 262-3 and positivism 245, 286, 299 presentation 311,"
    },
    {
        "page": "299",
        "text": " profession'). Another strategy -f Alternative Philosophical Paradigms 299 j CLI."
    },
    {
        "page": "103",
        "text": " ease of use and perceived usefulness, Cegielski et al. (2003) examined the perceptions of end-users of a LAN about ease of use and usefulness of their LAN. This was done via a survey of 299 respondents from 1 1 firms drawn from the"
    },
    {
        "page": "328",
        "text": "computing research cont. evidence-based research 3-4 experiments 137, 139—40 Internet research topics 45 IT artefact evaluation 116, 118 new research techniques 23 observation 213-14 philosophical paradigms 282-3, 292, 296, 297, 304"
    },
    {
        "page": "330",
        "text": "empirical assessment of systems, in computing research 2-3, 14, 18 empirical testing, in experiments 128-9 empowerment 296, 297, 298, 300, 303 encryption software 55, 65 end-users see users epistemology 282, 287 error, in data transfer"
    },
    {
        "page": "x",
        "text": "Briony J Oates. Evaluating positivist research 289 Practical work 290 Further reading 290 References 290 20. Alternative Philosophical Paradigms 291 Introduction 291 Interpretivism 292 Critical research 296 Linking research strategies to"
    },
    {
        "page": "336",
        "text": "194 power in critical research 296, 297, 298, 300-1,303 in group interviews 195 and participation 57, 60, 66, 160, 163 practical knowledge 165 practical outcomes 163-4, 166 practical problems 155—6 practitioner-researchers 208, 211, 214"
    },
    {
        "page": "332",
        "text": " 182 evidence-based research 2 experiments 136-7, 139, 140 Internet research topics 45-7 interviews 197-8 IT artefacts 1 1 8 new research techniques 23 observation 213-14 philosophical paradigms 282, 292, 296, 297 questionnaires 229"
    },
    {
        "page": "296",
        "text": " dominates and are seen to represent organizational reality, that is, the way the organization. (296 Researching Information Systems and Computing Y CL."
    },
    {
        "page": "162",
        "text": "We can't stand outside our world as dispassionate observers, we're necessarily already acting in it, forming relationships as we live and breathe. The aim of the new action research is therefore to support and enhance skills for being-in-the-"
    },
    {
        "page": "117",
        "text": " from the world outside academia, which will enhance the likely relevance of your research outcomes. However, differences between clients' interests and researchers' interests can sometimes cause difficulties and conflict. This is a particular"
    },
    {
        "page": "322",
        "text": "7 Do the tables and diagrams enhance the visual appeal of the paper and also aid the reader's comprehension of the research? 8 Is there any material that should be in an appendix rather than the main body, and vice versa? 9 Is evidence"
    },
    {
        "page": "238",
        "text": "For example, many formal organizational records are intended to show and enhance accountability. They are supposed to provide a detailed, systematic and accurate picture of some aspect of the organization. However, they only show what"
    },
    {
        "page": "46",
        "text": "Some artists are employed to enhance the aesthetic quality of commercial websites. Others have no financial objective and seek only to investigate the possibilities of Internet and web technologies, such as the scope for audience participation"
    },
    {
        "page": "104",
        "text": "He goes on to suggest that introducing hedonic features into utilitarian systems could enhance their acceptability to users. Yetton, Martin, Sharma and Johnston (2000) use two postal surveys to investigate critical success factors for systems"
    },
    {
        "page": "110",
        "text": "For example, a literature review to derive a set of principles for using IT to enhance democracy, an analysis of whether some political parties' websites currently conform to these principles, followed by a prototype application for a mythical"
    },
    {
        "page": "37",
        "text": "The use of more than one data generation method to corroborate findings and enhance their validity is called method triangulation. Many types of triangulation are possible in a research project: • Method triangulation: the study uses two or"
    },
    {
        "page": "331",
        "text": " 137, 299 and external validity 132-3, 137, 288 in Internet research 48 and interpretivism 294 in interviews 188, 199 in observation 215 in research process model 39 in surveys 96, 97-8, 100 and uniqueness 96, 97, 288-9 Gibb, F. 241 Gillies,"
    },
    {
        "page": "328",
        "text": " 26, 30-1 as research product 25 submissions 62-3, 311, 312, 313, 314 confidence level 100—1 confidentiality 5 1,59, 65, 117-18, 191,226,236 confirmability 294 constant comparative method 275 construct validity 221 constructs 108, 120-1,"
    },
    {
        "page": "340",
        "text": " 183, 297, 306 triangulation 37-8, 142, 155, 174, 212, 294-5 trustworthiness 192, 196, 209, 294, 295 Turkic, S. 181 UML 113 uncontrolled trials 134 uniqueness 133, 288-9, 300, 301 universal laws 284, 286, 289 unstructured interviews 188,"
    },
    {
        "page": "330",
        "text": " analysis) and research process model 33, 35 experts 159 see also practitioner-researchers; practitioners explanation 127-8, 296 explanatory case studies 143 exploratory case studies 143 external validity 132-3, 288, 294 F, Mand A 156-7,"
    },
    {
        "page": "333",
        "text": " K.H. 229 Lincoln, Y.S. 293, 294-5, 298, 305-6 line graphs 252, 253, 254 Linux operating system 17 list questions 224 literature reviews case study 82 conducting assessing 83-4 critical evaluation 85 obtaining 83 reading 84-5 recording 82,"
    },
    {
        "page": "329",
        "text": " A.R. 30 Denscombe, M. 178 Denzin, N.K. 214, 217, 305-6 deontological ethical decision-making 67 dependability 294 dependent groups t-test 262 dependent variables 127, 129, 130, 134-5 Depledge, G. 137 DeSanctis, G. 139 description,"
    },
    {
        "page": "xii",
        "text": " and computing 78 Table 7.1 Sampling techniques 96 Table 7.2 Target population sizes and sample sizes 101 Table 20.1 Quality in positivist and interpretivist research 294 List of Abbreviations ACM Association of Computing Machinery AIS"
    },
    {
        "page": "336",
        "text": " 281-3 and research ethics 67 see also critical research; interpretivism; positivism photographs 192, 223, 238, 273 pie charts 252, 254 plagiarism 62-3, 89-90, 92 plan-act-reflect cycle 155, 157 plausibility 295-6 Polese, G. 120 politicians 8,"
    },
    {
        "page": "330",
        "text": " R.D. 157 everyday thinking 4—6 evidence 2-4, 18, 24, 72, 176-7, 295, 313 examiners 73, 320, 321 exhibitions 318-19 experiential knowledge 165 experimental designs 134—5 experimental groups 64, 130, 131, 135 experimental mortality,"
    },
    {
        "page": "340",
        "text": " 193, 197, 198, 199 observation 208, 209 questionnaires 229 and research topic selection 28 surveys 104 time triangulation 37 Torvalds, Linus 17, 302 traceability 1 13 transcribing 193-4, 195, 266-7 transferability 295 Trauth, E.M. 181, 183,"
    },
    {
        "page": "331",
        "text": " 183 Hawthorne effect 204 Heijden, H. van der 104 Henderson, K. 241 Heron, J. 161, 165, 170, 293, 295, 298 Hevner, A.R. 121, 123 Hewson, C. 103, 106-7, 232 Hme, C. 181, 183, 198, 214, 217 Hirschheim, R. 14 historical case studies 144"
    },
    {
        "page": "337",
        "text": " 148-9 design and creation 116, 118 ethnography 174, 181, 300 interpretivism 293 quasi-experiments 133-4 reality 174, 284, 286, 287, 289, 292, 293-1, 295, 302 Reason, P. 162, 165, 166, 170 Rebman, C.M. 103 recording 82, 85-6, 190-1,"
    },
    {
        "page": "332",
        "text": " 262-3, 293, 300 interpretivism and action research 156, 301 and case studies 142, 152, 300 characteristics 292-3 and computing research 304 and data analysis 245, 276 definition 292 and design and creation 302-3 and ethnography 174,"
    },
    {
        "page": "339",
        "text": " and online interviews 50, 196 social problems, and action research 154-5 social skills see interpersonal skills socially constructed meaning 174, 292, 293-4, 300 software for conference presentations 315—16 for data analysis 246, 257, 258"
    },
    {
        "page": "x",
        "text": "Briony J Oates. Evaluating positivist research 289 Practical work 290 Further reading 290 References 290 20. Alternative Philosophical Paradigms 291 Introduction 291 Interpretivism 292 Critical research 296 Linking research strategies to"
    },
    {
        "page": "331",
        "text": " 232 Hme, C. 181, 183, 198, 214, 217 Hirschheim, R. 14 historical case studies 144 history, and internal validity 131-2 Hockey, J. 323 Hole, G. 135, 139, 265 holism 142, 174, 176, 214 Holwell, S. 292 Holyoak, K.J. 51 Horelli, L. 167 Howcroft,"
    },
    {
        "page": "328",
        "text": "computing research cont. evidence-based research 3-4 experiments 137, 139—40 Internet research topics 45 IT artefact evaluation 116, 118 new research techniques 23 observation 213-14 philosophical paradigms 282-3, 292, 296, 297, 304"
    },
    {
        "page": "338",
        "text": "references cont. and plagiarism 62, 89-90, 92 recording 83, 85-6 reflexive-practical outcomes 163-5 reflexivity 178-9, 210, 212, 292-3, 298, 300 refutation 285 Reips, U.-D. 140 Reithel, B.J. 103 relational praxis 162-3 relevance 10, 14 reliability"
    },
    {
        "page": "327",
        "text": " 136, 137, 288, 293-1, 299 Cegielski, C.G. 103 Cellan-Jones, R. 52 CERN (European Laboratory for Particle Physics) 44, 52 change 155, 158, 164-5, 168, 298, 301 charts 250-2, 254 Checkland, Peter 108, 112, 121, 156, 167, 170, 292, 302,"
    },
    {
        "page": "337",
        "text": " 148-9 design and creation 116, 118 ethnography 174, 181, 300 interpretivism 293 quasi-experiments 133-4 reality 174, 284, 286, 287, 289, 292, 293-1, 295, 302 Reason, P. 162, 165, 166, 170 Rebman, C.M. 103 recording 82, 85-6, 190-1,"
    },
    {
        "page": "292",
        "text": "Their own assumptions, beliefs, values and actions will inevitably shape the research process and affect the situation. Researchers must therefore be reflexive or self-reflective (both terms are. 292 Researching Information Systems and"
    },
    {
        "page": "268",
        "text": " of the types described above - the sections that are relevant to your research question(s). You need to categorize each segment or unit of data (a unit might be a word, sentence, paragraph or even a page), by writing in the margin a heading,"
    },
    {
        "page": "x",
        "text": "Evaluating positivist research 289 Practical work 290 Further reading 290 References 290 20. Alternative Philosophical Paradigms 291 Introduction 291 Interpretivism 292 Critical research 296 Linking research strategies to philosophical"
    },
    {
        "page": "ix",
        "text": "Philosophical Paradigms - Positivism 281 'Do I have to study this philosophical, airy-fairy stuff?' 281 Positivism and the scientific method 283 Criticisms of positivism 288 Evaluating positivist research 289 Practical work 290 Further reading 290"
    },
    {
        "page": "336",
        "text": " 157 plausibility 295-6 Polese, G. 120 politicians 8, 238 Popper, K. 290 populations and sample size 100-1 and sampling frames 95-6 and sampling techniques 96-9 portals 78-9 positivism and action research 156, 301 and case studies 142,"
    },
    {
        "page": "333",
        "text": " 17, 25, 27, 109-11, 165, 168 Kock, Ned F. 14, 92, 162, 163, 164, 170, 301 Kontogiannis, K. 14 Kowall, S. 194 Kozub, S.A. 265 Kraemer, K. 106 Kreuger, R.A. 201 Kuechler, W. 111-12, 121, 123 Kuhn, T, 290 Kyng, M. 168 Land, F. 41 Landoni"
    },
    {
        "page": "x",
        "text": "Briony J Oates. Evaluating positivist research 289 Practical work 290 Further reading 290 References 290 20. Alternative Philosophical Paradigms 291 Introduction 291 Interpretivism 292 Critical research 296 Linking research strategies to"
    },
    {
        "page": "23",
        "text": "However, as a new researcher, you should discuss with your supervisor the acceptability in your department or discipline of your proposed strategy and the risks involved in adopting a non-conventional method. You might decide to leave such"
    },
    {
        "page": "88",
        "text": "Conventional ISO methodologies are criticized for paying insufficient attention to the organizational context of computer systems. It is argued that the lack of consideration of the social and behavioural dimensions is the cause of failure of many"
    },
    {
        "page": "46",
        "text": "For example, the time available for the creation and implementation of a web-based system is usually much less than that for a conventional system, even though the functionality and complexity may be similar. There are research possibilities"
    },
    {
        "page": "331",
        "text": " 188-9 IEEE (Institute of Electrical and Electronics Engineers) 62, 74 implementation, in SDLC (conventional systems development life cycle) 40 implementations 115, 116 independent groups r-test 262 independent variables 127, 129, 131,"
    },
    {
        "page": "165",
        "text": "Conventional IS and computing action researchers, who are accustomed to providing knowledge to support organizational objectives (or objectives of the organization's powerful - see above), may therefore find their research challenged by"
    },
    {
        "page": "338",
        "text": " (conventional systems development life-cycle) 39-4O, 41 Scale, J.K. 241 search engines 79, 80, 81-2, 83 search terms 80-2 searching, in conducting literature reviews 80-3 secondary data 234, 236, 241, 243 security see data security;"
    },
    {
        "page": "179",
        "text": "discarding the conventional authorial power, and possibly revealing aspects of themselves that they might prefer to remain confidential. You have to decide how much detail about yourself to give, depending on the nature of the research topic,"
    },
    {
        "page": "339",
        "text": " action research 164 technological determinism 297-8 technology, and law 55 technology acceptance model 103-4, 229 telephone directories, in sampling 95-7 television, in literature reviews 76, 79 testing, in SDLC (conventional Index 339."
    },
    {
        "page": "340",
        "text": "television, in literature reviews 76, 79 testing, in SDLC (conventional systems development life cycle) 40 textbooks, in literature reviews 73 textual data, qualitative analysis 267-72 Thagard, P. 51 theme analysis 239, 268-72, 273-1 theoretical"
    },
    {
        "page": "77",
        "text": "For example, someone working as a computer artist would examine other artists' work, both digital artists and those working in conventional media, to find themes, or see how they tackled the problem the artist-researcher is interested in."
    },
    {
        "page": "89",
        "text": "Example of referencing convention using numbers Conventional ISO methodologies are criticized for paying insufficient attention to the organizational context of computer systems. It is argued that the lack of consideration of the social and"
    },
    {
        "page": "41",
        "text": "2 This chapter suggested an analogy can be drawn between the conventional systems development life cycle (SDLC) and the research process. Read Parnas and Clements' ( I 986) paper, entitled The rational design process. How and why to"
    },
    {
        "page": "110",
        "text": "The researcher examines how this has been tried in previous artistic works (conventional and digital) and then explores the artistic and technical viability of their alternative ideas using computer technology. Examples of research projects"
    },
    {
        "page": "120",
        "text": "If a particular concept is of interest, a user can ask for it to be bookmarked. Unlike the bookmarks provided in conventional browsers aimed at non-visually impaired users, semantic bookmarks are not closely tied to the physical structure of"
    },
    {
        "page": "39",
        "text": " outcomes) that has wider applicability than just your single project. The SDLC analogy We can also characterize the research process by drawing an analogy with the conventional systems development life cycle (SDLC) used in developing"
    },
    {
        "page": "225",
        "text": " nor disagree' point in the scale. However, some argue that this enables respondents to put a line of ticks in the 'don't know' column, without really thinking about how they feel. If you don't allow a 'don't know' option, you force respondents"
    },
    {
        "page": "28",
        "text": "In other types of research, it is accepted that the researcher's own feelings cannot be ignored, but they must not be allowed to 'force' the research into a particular conclusion. A simple test is to ask yourself, 'Do I know the answer to my research"
    },
    {
        "page": "56",
        "text": "You should accept their decision, and not try to force them by wheedling or threats. Their non-participation may affect your ability to complete your research, but that's your problem, not theirs. This f 56 Researching Information Systems and"
    },
    {
        "page": "1",
        "text": "In this chapter you will learn about: q the aims of this book; q the information systems and computing disciplines; q what we mean by 'research'; • the 6Ps of research; • the structure and content of this book. Aims of this Book This book is about"
    },
    {
        "page": "7",
        "text": "For some academic disciplines these are well- defined. However, for IS and computing there are several different academic communities, each with different ideas, or philosophies, about the kinds of research questions to ask and the process"
    },
    {
        "page": "143",
        "text": "Case study teaching is used in some disciplines, for example, business studies, where students study a particular instance and analyse what happened. In case study teaching, however, the case may be altered or simplified to bring out key"
    },
    {
        "page": "240",
        "text": "In most disciplines, documents have not been used in research as much as interviews, observations and questionnaires, and IS and computing are no exception. However, taking a document-based approach could be particularly relevant for"
    },
    {
        "page": "156",
        "text": "In this section, we concentrate on action research as it is commonly used in our disciplines. In the following section, we look at the way in which action research is now understood and used in some other disciplines - which could also be"
    },
    {
        "page": "14",
        "text": "Several papers in O'Brien, Gold and Kontogiannis (2004) review the kinds of empirical evidence that could be used in software engineering and lessons that can be learnt from other disciplines. Kling ( I 993) argues that computer scientists"
    },
    {
        "page": "304",
        "text": " how you perceive our world and what kind of knowledge you want to create; • whether you want to do the kind of research that is typically done in your discipline; • whether you are willing to take a risk and want to challenge the status quo."
    },
    {
        "page": "149",
        "text": "It has therefore been widely used in the IS discipline. It has been less used in the computing disciplines, but could be a very useful research strategy in computing research. For example, many researchers who use the 'design and creation'"
    },
    {
        "page": "2",
        "text": "IS is particularly concerned with the real-world social and organizational context in which information systems are developed and used. The computing discipline includes computer science, software engineering, information technology (IT),"
    },
    {
        "page": "336",
        "text": "philosophical paradigms cont. and disciplines 7, 304 ethics 67 overview 13, 281-3 and research ethics 67 see also critical research; interpretivism; positivism photographs 192, 223, 238, 273 pie charts 252, 254 plagiarism 62-3, 89-90,"
    },
    {
        "page": "344",
        "text": "Packed with examples from the IS and computing disciplines, learning objectives, definitions, evaluation guides and suggestions for practical work, this book has no equivalent in the market. Masters and PhD students and final year"
    },
    {
        "page": "335",
        "text": " 7-8 vivas 7, 8, 320-2 see also presentation; research topics, selection Phillips, E.M. 30 philosophical paradigms choosing 303—4 cross-country differences 7 philosophical paradigms cont. and disciplines 7, 304 ethics 67 overview Index 335"
    },
    {
        "page": "161",
        "text": "The previous section discussed the conduct of action research as commonly understood in IS and computing. In this section, we look at how it is now understood by some researchers in other disciplines. I call it here 'new action research', but"
    },
    {
        "page": "xv",
        "text": "therefore makes clear where the two communities differ in approach, includes examples of research from both disciplines and cites work from the literature of both. It addresses: q the kinds of research questions addressed in IS and computing;"
    },
    {
        "page": "61",
        "text": "The social science disciplines, such as psychology and sociology, make great use of research with the direct involvement of people, so their professional bodies' codes of conduct can also be helpful to IS and computing research."
    },
    {
        "page": "v",
        "text": "Contents. List of Figures and Tables xi List of Abbreviations xiii Preface xiv How to use this book xv Acknowledgements xviii 1. Introduction 1 Aims of this book 1 The IS and computing disciplines 1 Evidence-based practice 2 The Internet and"
    },
    {
        "page": "41",
        "text": " Sc Vessey, I. (2004). An analysis of research in computing disciplines. Communications of the ACM, 47(6), 89-94. Mingers, J., &amp; Willcocks, L.P. (2004). Social theory and philosophy -f Overview of the Research Process 41 j XXVII XXVIII."
    },
    {
        "page": "9",
        "text": "Some readers, perhaps particularly those in the computing disciplines, might by now be asking, 'What's all this got to do with me? I just want to develop a computer system/ build a website/create a computer animation [delete as appropriate]"
    },
    {
        "page": "139",
        "text": "The book is aimed at psychology students but is useful for researchers in other disciplines too. It covers different experimental designs, how to analyse and interpret the data using statistics, and how to write up the experimental research."
    },
    {
        "page": "235",
        "text": "However, since a large part of IS and computing is concerned with the design and use of digital multimedia, perhaps we can except to see more use of multimedia documents for research in these disciplines in future. Veda is interested in the"
    },
    {
        "page": "123",
        "text": "Another useful bibliography of references on design research in many disciplines - including computing - with commentary on the most popular references, is a special issue of the Visible Language journal (VL, 2002). Overviews of digital art"
    },
    {
        "page": "xiv",
        "text": "This book is an introductory text on research methods for those in the information systems (usually shortened to IS) and computing disciplines. It is suitable for individual study by novice researchers, particularly those embarking upon masters"
    },
    {
        "page": "57",
        "text": "However, this should be a concise description, not pages and pages for people to plough through, and written in language that is easy for the participants to understand. It is also often recommended that the participants' consent -( Participants"
    },
    {
        "page": "81",
        "text": "Briony J Oates. Figure 6.1 Splitting a research topic into separate concepts Figure 6.2 Alternative terms for research concepts you interested in all kinds of IT, or specific types, for example, websites, mobile phones, interactive digital television?"
    },
    {
        "page": "82",
        "text": "Example Outcome attitude mobile AND phones mobile OR phones 'mobile phones' Results contain words such as attitude, attitudes, attitudinal Results contain both terms, but they do not necessarily occur together Results contain at least one"
    },
    {
        "page": "30",
        "text": "(Remember students have home and social lives, as well as their university-based lives, you could take 'students' to be at school or university, or 'lifelong learners', and IT could cover digital communications, such as mobile phones, as well as"
    },
    {
        "page": "45",
        "text": "including mobile phones and personal handsets, leading to the notion of 'ubiquitous computing' or 'anytime, anywhere computing'. However, the rise of the Internet and web has also led to some undesirable outcomes. Parents worry about"
    },
    {
        "page": "44",
        "text": " over the Internet. The Internet can also be accessed from devices other than a standard desktop computer, including mobile phones and personal handsets, leading to the notion ( 44 Researching Information Systems and Computing V."
    },
    {
        "page": "44",
        "text": "If the most direct route was not available, routers would direct traffic around the network via alternative routes. Through the 1970s and 1980s, various communication protocols were developed and agreed, and increasing numbers of"
    },
    {
        "page": "13",
        "text": "Each chapter also includes suggestions for further reading that will direct you to other work explaining the ideas discussed in the chapter, and to examples of research in IS and computing where these ideas have been used. Find several"
    },
    {
        "page": "165",
        "text": "This means that at least four different types of knowledge can emerge from action research: experiential, presentational, propositional and practical (Heron, 1996): • Experiential knowledge: gained by direct encounter; almost impossible to put"
    },
    {
        "page": "65",
        "text": "So maybe you should not provide any direct quotes at all? But then you will not be able to provide enough raw, qualitative data to satisfy reviewers of your research report. There are no easy answers to ethical issues in Internet research."
    },
    {
        "page": "61",
        "text": "The social science disciplines, such as psychology and sociology, make great use of research with the direct involvement of people, so their professional bodies' codes of conduct can also be helpful to IS and computing research."
    },
    {
        "page": "10",
        "text": "Relevance is defined as 'being pertinent, having direct bearing'. However, few researchers explain relevance to whom. The common assumption is relevance to 'practitioners', but again these are left undefined. 'Practitioners' can be people"
    },
    {
        "page": "158",
        "text": "Consultants operate under tighter time and budget restraints. You need to be clear at the start of a project whether you are undertaking action research or consultancy. Papers submitted to research journals are rejected if they look as though"
    },
    {
        "page": "236",
        "text": "For example, market research companies publish their findings, but charge a high price, often beyond the budget of many researchers. Other documents may be sensitive and confidential, for example, internal company memos or police"
    },
    {
        "page": "160",
        "text": "Often the client is a budget-holder within an organization - if they are not happy, the action research project does not continue. Such a client's interests and needs do not always coincide, however, with the interests and needs of people lower"
    },
    {
        "page": "137",
        "text": "Smith, Keil and Depledge (2001) investigated the problem of 'runaway' information systems, where people in an organization are reluctant to report negative news about a project, so it continues, running over time and budget. They used an"
    },
    {
        "page": "340",
        "text": " 158, 159 in case studies 146-7, 149-50 in creation and design 109 in ethnography 177-8 in participant observation 210 and quantitative data analysis 270-1 re-interpretation 22 and research product 22, 24, 27 testing 20 theses 7-8, 25, 277,"
    },
    {
        "page": "328",
        "text": " 81-2, 87, 88, 145-6, 270-1 conceptualizing 39, 40 conference papers case study reporting 148 in literature reviews 75, 79, 84, 85 presentation 314-18, 319-20 as research idea source 25, 26, 30-1 as research product 25 submissions 62-3,"
    },
    {
        "page": "329",
        "text": "data generation methods cont. and strategies 37 in surveys 95, 102-3 and triangulation 37-8, 142 data interpretation 208, 262-3 data protection law 55 data security 59, 61, 65 data segments 268-9, 270 data transfer errors 102 Davies, L.J. 181"
    },
    {
        "page": "339",
        "text": " 301-3 r-test 261-2 tables 249-50, 254, 270 Tang, N.K.H. 167 Tapia, A.H. 150 Tavani, H.T. 69 Tavistock Institute 154 technical action research 164 technological determinism 297-8 technology, and law 55 technology acceptance model 103-4"
    },
    {
        "page": "270",
        "text": "You build up a theory about what your data 'says' - linking it to any theories you might have included in your original conceptual framework, to what the literature Figure 18.2 Using a table to analyse data - use (270 Researching Information"
    },
    {
        "page": "80",
        "text": "Try to be disciplined: don't follow up every link unthinkingly, bookmark sites that look relevant and come back to them later. It is also a good idea to restrict yourself to, say, an hour of web surfing before coming offline and working on what you"
    },
    {
        "page": "132",
        "text": "Many of the analysts are concerned about their future, which is likely to have affected their stress levels. • Maturation: participants change between tests. An obvious example is any experiment involving children. You could test 4-year-olds'"
    },
    {
        "page": "27",
        "text": "Only you can really know what you're likely to find enjoyable - although your friends and family might be able to advise you, based on their knowledge of you. To help you think about the feasibility, ask yourself the following questions: q Is the"
    },
    {
        "page": "98",
        "text": "Non-probability sampling techniques include: • Purposive sampling: here, the researcher deliberately hand-picks the sample, choosing instances that are likely to produce valuable data to meet the purpose of the research. Instead of choosing"
    },
    {
        "page": "38",
        "text": " to the idea of a single reality, believing any notion of 'reality' to be constructed by individuals and groups, so there are multiple realities for people in our world, and different research approaches are likely to lead to different findings. Interview"
    },
    {
        "page": "117",
        "text": "You, on the other hand, may think that particular area of development is the most interesting and the one most likely to lead to new knowledge. There can also be difficulties if the researcher runs out of time and realizes that it is necessary to"
    },
    {
        "page": "192",
        "text": "As you move onto the main body of the interview, start with an easy question, one where the interviewee is likely already to have well-formed views. Then you can ask more questions about the response, or move onto your other topics."
    },
    {
        "page": "75",
        "text": "Conference and workshop proceedings are therefore where you are likely to find the most up-to-date theories, as well as suggestions for further research, which you, of course, could follow up. However, conference and workshop proceedings"
    },
    {
        "page": "237",
        "text": "For example, Cord and Thompson (2004) cite a study in 1991 that found that 90 per cent of qualitative data from academic research was either lost or at risk - sitting in researchers' homes or offices, inaccessible to others and likely to be lost"
    },
    {
        "page": "315",
        "text": "You could, for example, focus on: q the aspect you are particularly proud of; q an argument you want to make; • what the audience is likely to be most interested in; q the area where you are seeking advice from the audience. Make sure the font"
    },
    {
        "page": "223",
        "text": "They are especially useful for questions where you realize there is a wide range of possible answers or you just don't know how the respondents are likely to answer. On the other hand, open questions require more effort than closed questions"
    },
    {
        "page": "133",
        "text": "You can also design your experiment carefully so that it is likely to have high external validity. The main threat to external validity comes from non-representativeness - using a test case or sample of participants that is not typical of those found"
    },
    {
        "page": "57",
        "text": " address, contact details) and which organization is sponsoring it - either by funding it or overseeing and authorizing it; • what will be involved (for example, interviews, completing a questionnaire and so on) and how long this is likely to take;"
    },
    {
        "page": "196",
        "text": "Because responses have to be typed, they are likely to be shorter and less expansive than in a face-to-face interview. In online interviews, we also lose the richness of gestures and facial expressions and the context of a face-to-face interview."
    },
    {
        "page": "64",
        "text": " combined with software that can guarantee the anonymity of the perpetrator of an unethical or unlawful act, make it less likely that a wrongdoer will be caught. • New means of data gathering: new information and communication technologies"
    },
    {
        "page": "84",
        "text": "As with journals, conferences that have been held annually for many years are likely to be respected, but the converse is not necessarily true. q Does the conference/workshop give details of its programme committee? Do they appear to be"
    },
    {
        "page": "304",
        "text": "However, as Chapter 19 explained, when they want to justify the need for a particular IT artefact, or evaluate an artefact they have created, they are likely to need an additional research strategy, where the underlying philosophy cannot be"
    },
    {
        "page": "225",
        "text": "Price On-site repair Familiar vendor's name Delivery within one week 12-month warranty On-site initial set-up Make sure you don't use too many types of questions in one questionnaire - you are likely to confuse your respondents, and the"
    },
    {
        "page": "260",
        "text": "Or did we just happen to get an unrepresentative sample of students? How likely is it that we used an untypical sample of students drawn, by chance, from a student population where there is no relationship between gender and performance?"
    },
    {
        "page": "106",
        "text": "Are some groups more likely than others to find it difficult or impossible? How could you research whether your lists (of reasons and factors) are true or complete? Who might be interested in the results of your research, and why? Finally"
    },
    {
        "page": "93",
        "text": "It is quite likely that you will find an issue of an IS journal where all the articles that report on empirical research (that is, research involving the generation of data from the field) used a survey. In computing, a common use of a survey is in the LII."
    },
    {
        "page": "89",
        "text": "The more you find your eyes going back and forth from the keyboard or screen to the original paper, the more likely it is that you might plagiarize. Cutting and pasting from electronic sources is also plagiarism. If you want to use someone's"
    },
    {
        "page": "28",
        "text": "Is the research and its outcomes likely to be of sufficient scope to meet your course requirements? The scope expected of a 3-4 week research project carried out as part of a taught course is clearly much less than that expected of a PhD"
    },
    {
        "page": "104",
        "text": " and inclusive coverage of people or events, so that the results are likely to be representative of the wider population. This means that generalized conclusions can be drawn. q Relative to some other strategies (for example, ethnography),"
    },
    {
        "page": "299",
        "text": " they cannot confirm cause and effect, as experiments do. They are weaker than experiments in the sense that they can only confirm an association (for example, 'Systems analysts who expressed the highest job satisfaction were more likely"
    },
    {
        "page": "83",
        "text": "How long has the journal existed? You can tell this by looking at the volume number: the higher it is, the longer the journal has existed. One that has existed for a long time is likely to have established itself as a respectable journal. However"
    },
    {
        "page": "221",
        "text": "Most questionnaires are self-administered, which saves on the researcher's time and means that more people can be asked to complete the questionnaire. The respondents are also less likely to try to please the researcher by giving what they"
    },
    {
        "page": "100",
        "text": "Sample size You need to decide how big you want your final sample to be, taking into account your best estimate of the likely non-response rate of participants. For small-scale research projects, as in many first-time researchers' projects,"
    },
    {
        "page": "43",
        "text": " Internet offers both new research topics and new ways of doing research. Many readers of this book are likely to do research into, or supported by, the Internet, so this chapter pulls together some of the themes and issues of Internet research."
    },
    {
        "page": "209",
        "text": " continue to do your own job and also to be a researcher. Further difficulties are discussed below. Process. Participant observation is time-consuming. The longer you can spend in a situation, the more you are likely to learn. Start by being"
    },
    {
        "page": "102",
        "text": "Online they can also simply delete an email questionnaire, but they are more likely also to send you an angry email. It is a good idea to send a short introductory message prior to the actual questionnaire - people can then decline to receive it,"
    },
    {
        "page": "113",
        "text": " carried out thoroughly so it is more likely to be correct, before moving onto the next stage. However, for complex systems development it may not be possible to do a full analysis first. As already explained, often it is only through designing"
    },
    {
        "page": "273",
        "text": "However, non-textual data is likely to play a much more central role in IS and computing research, since the web and its multimedia documents is a highly important research arena, information systems increasingly make use of visual aspects"
    },
    {
        "page": "301",
        "text": " that are testable in further studies, allowing repeatability and generalizations. However, action research is always likely to be criticized by positivists for lack of researcher objectivity: the action researcher is not an objective observer but"
    },
    {
        "page": "37",
        "text": " you are likely to produce more data, which could improve the quality of your research, but this may take longer and cost more. Using more than one data method also allows the findings from one method to be corroborated or questioned by"
    },
    {
        "page": "119",
        "text": "Nor is it likely that someone else will need to come along and modify a piece of digital art in the future, so thorough documentation is less important. Nevertheless, if the production of digital art is to be considered as research, it is still important"
    },
    {
        "page": "340",
        "text": "television, in literature reviews 76, 79 testing, in SDLC (conventional systems development life cycle) 40 textbooks, in literature reviews 73 textual data, qualitative analysis 267-72 Thagard, P. 51 theme analysis 239, 268-72, 273-1 theoretical"
    },
    {
        "page": "334",
        "text": " in literature reviews 73 morality, and science 61 Morgan, G. 23, 269 Morris, M.G. 229 motivations, and research 16-21, 26, 33-4 MPhil, and literature-based surveys 23 Mukherjee, S. 120-1 multimedia documents 37, 76-7, 235, 240, 273"
    },
    {
        "page": "336",
        "text": "Briony J Oates. philosophical paradigms cont. and disciplines 7, 304 ethics 67 overview 13, 281-3 and research ethics 67 see also critical research; interpretivism; positivism photographs 192, 223, 238, 273 pie charts 252, 254 plagiarism 62-3,"
    },
    {
        "page": "280",
        "text": "273-285). London: Sage. Strauss, A., &amp;: Corbin, J. (1997). Grounded theory in practice. London: Sage. Strauss, A., &amp; Corbin, J. (1998). Basics of qualitative research. Techniques and procedures for developing grounded theory (2nd ed.)."
    },
    {
        "page": "326",
        "text": " 198 ASA (American Sociological Association) 62 assessing, in conducting literature reviews 83-4 association 299-300 Atkinson, P. 183,217 audio tape recordings 191, 193-4, 195, 267-8, 273, 274 authenticity, in critical research 298 authors"
    },
    {
        "page": "ix",
        "text": "Qualitative Data Analysis 266 Introduction 266 Analysing textual data 267 Analysing non-textual qualitative data 273 Grounded theory 274 Computer-aided qualitative analysis 276 Evaluating qualitative data analysis 277 Practical work 278"
    },
    {
        "page": "337",
        "text": "Qualidata 237 qualitative data 237, 266 qualitative data analysis data types 266 documents 239 evaluating 277-8 interpretivism 293 non-textual data 273-4 presentation 311, 313 problems with 267, 277 and research process model 33,"
    },
    {
        "page": "276",
        "text": "Computer-aided. Qualitative. Analysis. There are software programs to help you analyse qualitative data - both freeware and commercial software products. You should find out whether your institution already has such software tools. You may"
    },
    {
        "page": "109",
        "text": "For example: q a theory on the psychology of colour in different cultures applied to a user interface design; q an educational theory incorporated into a computer-aided learning package; • an economic theory on consumer behaviour applied to"
    },
    {
        "page": "254",
        "text": "However, they are dependent on the researcher's individual interpretations of the data, aided by tables and charts whose formats the researcher decides. Statistical techniques, on the other hand, offer more universal means and criteria for"
    },
    {
        "page": "327",
        "text": " Daniel 121 Broy, M. 30-1 BSA (British Sociological Association) 62 bulletin boards 64, 103 Bush, Vannevar 44, 52 businesses, and Internet 44, 45 Cahill, S.E. 323 Cailliau, R. 52 CASE (Computer-Aided Software Engineering) 120, 146, 150,"
    },
    {
        "page": "xiii",
        "text": "List. of. Abbreviations. ACM Association of Computing Machinery AIS Association for Information Systems BCS British Computer Society CASE Computer-aided Software Engineering CERN European Organisation for Nuclear Research IEEE"
    },
    {
        "page": "22",
        "text": " the development of user interfaces, management information systems or computer- aided learning. The researcher explores whether and how the theory can be incorporated into a new design. Sometimes a theory might need to be"
    },
    {
        "page": "ix",
        "text": "Qualitative Data Analysis 266 Introduction 266 Analysing textual data 267 Analysing non-textual qualitative data 273 Grounded theory 274 Computer-aided qualitative analysis 276 Evaluating qualitative data analysis 277 Practical work 278"
    },
    {
        "page": "110",
        "text": " happens when the computer application is used in a real-life context. For example, a computer-aided learning package could be developed, but the primary focus of the research is on how the students and teachers then use and adapt it in"
    },
    {
        "page": "280",
        "text": "Strauss, A., &amp; Corbin, J. (1994). Grounded theory methodology - An overview. In N.K. Denzin &amp; Y.S. Lincoln (Eds.), Handbook of qualitative research (pp. 273-285). London: Sage. Strauss, A., &amp;: Corbin, J. (1997). Grounded theory in practice."
    },
    {
        "page": "328",
        "text": " empowerment; power control groups 64, 130, 131, 135, 301 controls, in experiments 129-30, 137 convenience sampling 98 Coolodge, F.L. 265 copying 63, 268 copyright 63, 236, 243 Corbin, J. 275, 276 correlation coefficients 258-9 Corti,"
    },
    {
        "page": "276",
        "text": " Strauss, Strauss and Corbin or other 'grounded theory theorists' - see the 'Further Reading' section for guidance. Grounded theory can be used in positivist research, but is more widely used in interpretivist and critical research (see Chapter"
    },
    {
        "page": "221",
        "text": "Most questionnaires are self-administered, which saves on the researcher's time and means that more people can be asked to complete the questionnaire. The respondents are also less likely to try to please the researcher by giving what they"
    },
    {
        "page": "227",
        "text": "q Reliability: is concerned with whether a questionnaire would yield the same results if given repeatedly to the same respondents. Unfortunately, this is usually difficult to assess - respondents could change their views over time, or remember"
    },
    {
        "page": "310",
        "text": "Only by repeatedly writing, showing your work to others and rewriting will you become good at it. Often the literature review can be written early in a research project, while it is still fresh in your mind. (But continue to watch out for any new"
    },
    {
        "page": "270",
        "text": "If researchers are using hard copies of the data, they often literally cut and paste together all the segments that relate to one theme (remembering to include each segment's location code, so they know where it came from) and then read and"
    },
    {
        "page": "89",
        "text": " likely it is that you might plagiarize. Cutting and pasting from electronic sources is also plagiarism. If you want to use someone's words because they express an idea perfectly, then you should put those words Reviewing the Literature 89 J."
    },
    {
        "page": "322",
        "text": "2 Does the report have a clearly signposted structure and logical sequence? 3 Have the necessary conventions been followed, appropriate to the discipline and intended readers? 4 Does the abstract effectively summarize the content of the"
    },
    {
        "page": "84",
        "text": "It is not valid to infer that a journal that has not existed for long cannot be a respectable source. q Does the journal provide a list of its editorial board and advisors, and do these people seem to be of high standing? If they are, then the journal is"
    },
    {
        "page": "215",
        "text": "2 Does the researcher provide the observation schedule? If not, how does this affect your confidence in the research? 3 Do you think the items observed were easily observable, unambiguous and independent from each other? Did they occur"
    },
    {
        "page": "28",
        "text": "Note that funding bodies are becoming much more prescriptive on the maximum time allowed for PhDs. q Does the research topic fit in with your own motivations, strengths and weaknesses, likes and dislikes? For example, it would be foolish"
    },
    {
        "page": "160",
        "text": "However, it does raise more questions about the true extent of participation. Does the students' lower status and authority (compared with their supervisor) militate against authentic collaboration? How can academic supervisors guard against"
    },
    {
        "page": "182",
        "text": "Do you think enough methods were used and enough data collected? 3 How long did the researcher spend in the field? Do you think this was long enough? 4 Does the work seem to belong to the holistic, semiotic or critical school? 5 Is the"
    },
    {
        "page": "151",
        "text": "(For example, 'exploratory, multiple and longitudinal'.) 3 What data generation methods were used? Do you think enough methods were used and enough data collected? 4 How long did the researcher spend in the field? Do you think this was"
    },
    {
        "page": "90",
        "text": "1 Does the paper review any previous literature? 2 What types of literature sources does it draw upon (for example, books, journal articles, conference papers) and in what proportion? 3 Are all the sources of a suitable type for use in academic"
    },
    {
        "page": "20",
        "text": "Others do it because they think it will help them in their future career. And for women, becoming a 'Doctor' does finally resolve the Mrs/Miss/Ms issue! To test or disprove a theory As we shall see later, testing and disproving a theory is the main"
    },
    {
        "page": "27",
        "text": "There are times when many researchers become bored with particular aspects of their research (for example, chasing up reference details, or negotiating access), but if the overall topic does not interest you then it is unlikely that you will do"
    },
    {
        "page": "246",
        "text": "More complex statistical techniques enable you to establish whether patterns you see in the data really do exist and are not just the result of chance. You should read this chapter before you even start producing any quantitative data - so that"
    },
    {
        "page": "288",
        "text": "Does the research hang together as a piece of coherent and accurate work so that the data generated really does lead to the researchers' claimed findings? Are the researchers justified in saying that A causes B and a causal relationship"
    },
    {
        "page": "19",
        "text": "How does the advent of Internet shopping affect family relationships in the home? Stereotypes suggest women do the weekly grocery shopping, but men are the main technology users, so who does the shopping from an online supermarket?"
    },
    {
        "page": "305",
        "text": "1 Do the researchers explain the paradigm sufficiently for readers unfamiliar with it? 2 Does the research display all the characteristics of its particular paradigm, as discussed in this chapter? 3 Does the account of the research meet the quality"
    },
    {
        "page": "186",
        "text": "It has a set of assumptions (normally unspoken) that do not apply to 'normal' conversations. Usually, one person has a purpose for undertaking the interview: they want to gain information from the other(s). This means that the discussion does"
    },
    {
        "page": "299",
        "text": "They demand objectivity: it is assumed, and required, that experiments can be carefully designed to ensure that the researchers themselves do not influence the outcome. They use quantitative data and mathematical techniques to measure"
    },
    {
        "page": "98",
        "text": "This technique is useful when the researcher does not know how to gain access to the target group. Having found just one respondent - still often difficult, of course - the researcher is put on to the track of others. This could be used, for example"
    },
    {
        "page": "161",
        "text": "tacitly agrees to construct a pseudo-reality. To counter this, an explicit 'devil's advocate' procedure (Heron, 1996, pp. 146-148) can be built into the research process. One or more group members regularly try to show that a theory does not"
    },
    {
        "page": "313",
        "text": "Can your answer be generalized to other situations, or does it have implications for practice? Once you can answer the six questions listed above, you should be able to construct your argument that there was a question to answer, you've"
    },
    {
        "page": "26",
        "text": "Be careful though, to make sure you can identify an academic research aspect to such work, and that it does not just call for the use of your technical abilities. Calls for conference papers or special issues of journals on a particular theme."
    },
    {
        "page": "277",
        "text": "You should make your own mind up. Remember, though, that a tool cannot do the analysis for you - it can help you search and find links, but cannot identify categories, have sudden intuitive leaps or develop an explanation of the data."
    },
    {
        "page": "105",
        "text": "They do not provide much detail on research topics; instead the focus is on breadth of coverage. q They tend to focus on what can be counted and measured, and subject to statistical analysis. Aspects of the research topic that cannot be"
    },
    {
        "page": "216",
        "text": "Do you think this was long enough? 3 Did the researcher avoid disrupting the naturalness of the setting? 4 Has the researcher reflected on self-identity and how it affected access, perception of events and the reactions of others? 5 Has the"
    },
    {
        "page": "76",
        "text": "For example, the number of people with Internet access: does it include those with a PC at home, and also those who access the Internet from school or from their place of employment? What about those who use a friend's PC, or an Internet"
    },
    {
        "page": "46",
        "text": "The Internet does not just support the gathering or dissemination of information  The Internet can even trigger new ways of philosophizing about ourselves and our existence: what does it mean 'to be' in ( 46 Researching Information Systems"
    },
    {
        "page": "87",
        "text": " some new knowledge, specifically that: • the topic is worthwhile; q the research does not merely repeat the work of others (or if it does, there is a deliberate reason for this); • You have created some new knowledge that was not known before."
    },
    {
        "page": "72",
        "text": "Similarly, researchers assemble evidence to support their claims that: q the topic is worthwhile; • the research does not merely repeat the work of others (or if it does, there is a deliberate reason for this); • the researcher has created some new"
    },
    {
        "page": "196",
        "text": "Researchers also have to either take on trust that their informants are who they say they are, or do some detective work to try and establish whether they are really qualified to speak on the subject. Similarly, informants need to be convinced"
    },
    {
        "page": "320",
        "text": "q 'What area of research are you working on?' • 'I've just heard an interesting presentation on  . Were you there?' • 'What did you think of this morning's keynote talk?' • 'I see you're from X University. Do you know Y who works in the Business"
    },
    {
        "page": "209",
        "text": "If you gain the people's trust, so that they accept your presence and even forget that you are there sometimes, you can learn about what they do and how they feel about it. A practitioner-researcher is someone who already has a job and"
    },
    {
        "page": "131",
        "text": "For example, most IS and computing researchers do not have access or the expertise to use medical equipment that can measure stress levels in humans (for example, heart rate, blood pressure, skin conductance). Instead, we might have to"
    },
    {
        "page": "77",
        "text": "If the abstract does suggest that the article would be useful, make sure that you do order and read the whole text. Do not cite an article in the review if you have only read the abstract - sometimes an article turns out to be very different from what"
    },
    {
        "page": "18",
        "text": "Does the approach live up to the claims made for it by academics or commercial vendors? To find the evidence to inform practice How do we develop computer systems? How should we? Can we come up with better ways? Many methods"
    },
    {
        "page": "301",
        "text": "Also like ethnographers, however, they can be criticized for not addressing all the tenets of critical research if they merely describe and do not empower those who are being oppressed to challenge and remove the barriers that are holding"
    },
    {
        "page": "51",
        "text": "You might want to look at a certain website as part of your research, but to do so would mean breaking your country's laws. For example, in the UK visiting a site aimed at paedophiliacs and downloading material from it would be illegal - and"
    },
    {
        "page": "134",
        "text": "However, such activity does not meet the tenets of either a true or a quasi-experiment. A systems developer could, for example, introduce a new systems development method. But how will they know the effect of the introduction of the new"
    },
    {
        "page": "78",
        "text": " MCS Media and communication studies SOSIG Social sciences www.artifact.ac.uk/ www.bized.ac.uk www.eevl.ac.uk www.thegateway.org www.aber.ac.uk/media/index.html www.sosig.ac.uk 1 Does the paper review any previous literature?"
    },
    {
        "page": "60",
        "text": "This means not keeping quiet about data that does not support your case, or not manipulating data to present the picture you want. You should be open and honest f 60 Researching Information Systems and Computing V XXXVIII."
    },
    {
        "page": "146",
        "text": "Rich insight is what we might glean from reading a case study that does not fit neatly into the three categories of concept, theory or implications, but nevertheless give us important new understanding about a situation. Relationship to theory"
    },
    {
        "page": "142",
        "text": "A case study approach does not test hypotheses, as in experiments (see Chapter 9), but from studying a particular instance, insight can be gained and knowledge generated that might also be relevant to other situations. Research based on a"
    },
    {
        "page": "174",
        "text": "The ethnography does not take place in an artificial experimental setting, but in the natural setting of the subjects, which, as far as possible, should be undisturbed by the presence of the ethnographer. q The ethnographer becomes the"
    },
    {
        "page": "291",
        "text": "It has been a very successful way of finding out about the natural world we live in, but does have limitations when it comes to studying the social world, that is, the ways of seeing and doing, cultures and norms, and patterns of behaviour that"
    },
    {
        "page": "41",
        "text": "Does one type predominate? Decide whether you would prefer to: a follow the strategy and method(s) used by the majority of researchers in your area; b follow a less-used research methodology. What are the advantages and disadvantages"
    },
    {
        "page": "169",
        "text": "ACTON. RESEARCH. 1 Did the work involve an iterative cycle of plan-act-reflect? How many cycles are described? Do you think this is enough? 2 Do the researchers make explicit their framework of ideas (F), methodology (M) and area of"
    },
    {
        "page": "115",
        "text": "How far do you go? Some institutions require that a project demonstrate the whole development life cycle: analysis, design, implementation and testing. However, such a requirement is more common at undergraduate and masters level than"
    },
    {
        "page": "194",
        "text": "Of course, most interviewees do not speak in complete, audible sentences, and there are false starts and pauses. Most researchers try to transcribe the words exactly as spoken, but may edit them slightly (to lose the 'erms' and 'uhs') when"
    },
    {
        "page": "221",
        "text": "In a researcher-administered questionnaire, there is a danger that respondents are asked the questions in a different manner, because the researcher varies their tone, or body language. Researcher-administration does, however, usually lead"
    },
    {
        "page": "101",
        "text": " confidence level and +/- 3 per cent Target population size accuracy range Source: www.geneseesurvey.com/web/webcalc.asp Note that the sample size does not need to increase at the same rate as the target population size (Table 7.2)."
    },
    {
        "page": "68",
        "text": "1 Do the researchers discuss the ethics of their research and whether they were guided by any code of ethical conduct? If not, how does that affect your confidence in the research? 2 Do the researchers tell us of any ethical dilemmas they"
    },
    {
        "page": "5",
        "text": "Obtain prices of new tyres What is the cheapest? That's more than I want to pay. I need more information. Is it reparable? Obtain prices for tyre repair. Can it be repaired? What is the lowest cost? How does the cost compare with a new tyre?"
    },
    {
        "page": "73",
        "text": "It is hard to conceive of a research paper or thesis that does not contain any references to the literature - there is no escape. Therefore a further, often unspoken, purpose of a literature review is simply for research students to demonstrate that"
    },
    {
        "page": "273",
        "text": " rendering, background sounds, perspective, and so on? • Author: who produced it, in what circumstances and why? • Viewer: how does a viewer interpret or react to the piece? You might find you need to produce several different transcripts"
    },
    {
        "page": "116",
        "text": "Many computing researchers do not evaluate whether the artefact does work in a real-life context. Their objective is to show 'proof of concept' only, via a functioning prototype. The prototype's purpose is to show that the researcher's design"
    },
    {
        "page": "255",
        "text": "Senior manager 1 Junior manager 2 Systems developer 3 Call centre operative 4 and then to declare the mean job role was 3.7. The mean forms the basis for various statistical tests and is widely used. However, it does have disadvantages."
    },
    {
        "page": "285",
        "text": "A hypothesis can also be refuted if a researcher is able to show by experiment that the claim that A causes B does not hold true in certain circumstances. The more a hypothesis can stand up to tests designed to refute it, the stronger it is."
    },
    {
        "page": "38",
        "text": "'Interpretivists', on the other hand, do not subscribe to the idea of a single reality, believing any notion of 'reality' to be constructed by individuals and groups, so there are multiple realities for people in our world, and different research"
    },
    {
        "page": "96",
        "text": "Non-probability sampling means that the researcher does not know whether the sample of people (or events) is representative - each member might have unique characteristics not shared with others in the overall population. Non-probability"
    },
    {
        "page": "110",
        "text": " an analysis of whether some political parties' websites currently conform to these principles, followed by a prototype application for a mythical political party that does demonstrate application of the principles. • An IT application is developed,"
    },
    {
        "page": "181",
        "text": "She explored the two-way interaction between the cultural context and the information economy work, workers and workplaces in Ireland posing two research questions (p. 17): • How does the socio-cultural context within which the information"
    },
    {
        "page": "213",
        "text": "For example, if it shows that someone spent a long time on a particular webpage, it does not necessarily mean that they found that page interesting. They could have had a slow computer or network connection, or they could have turned away"
    },
    {
        "page": "47",
        "text": "and our existence: what does it mean 'to be' in cyberspace? Who am I, when I can be one person in the offline world and another in an online world? As this section has indicated, there are many, many possible research topics if you are"
    },
    {
        "page": "40",
        "text": "I Research: Follow the design to do the research (for example, issue a questionnaire and analyse the responses). Testing • SDLC: Evaluate the system to see if it functions as intended and meets the requirements specification or client's brief"
    },
    {
        "page": "118",
        "text": "Finally, you may find that a client is willing to let you develop an IT system to address a problem but does not want you to evaluate the system in use in the organization, perhaps because of fears of disrupting the work of the employees. This is"
    },
    {
        "page": "10",
        "text": "Part of the problem is that most researchers do not provide definitions of rigour or relevance, relying instead on supposed common intuition. So what do these terms mean? Rigour encompasses both systematic conduct and validity. Systematic"
    },
    {
        "page": "17",
        "text": "To add to the body of knowledge Some researchers want to add to what is known about their specialist subject, and it does not really matter whether the new knowledge has any practical application. For example, right now someone might be"
    },
    {
        "page": "195",
        "text": "'Jean, what do you think?1 • 'What do the rest of you think about this?' • 'How does Mike's point relate to the one you raised, Sarah?' q 'What do people think of Atta's suggestion?' It is very hard to facilitate a group discussion and keep notes at"
    },
    {
        "page": "207",
        "text": "Seating arrangements: Date: Time: Observer: Contextual factors: Names of group members: A: B: C: D: E: Instructions: Note each time a group member does one of the activities Figure 14.3 Schedule for observing group meetings to ask"
    },
    {
        "page": "25",
        "text": "But how do we get started? That is, how do we find research topics? Sometimes they emerge out of personal circumstances and opportunities. For example, a disabled person might be frustrated by the poor accessibility of many websites, and"
    },
    {
        "page": "147",
        "text": "Only when new data seems to confirm the researcher's theory, rather than add anything new, does the case study come to an end. At this point, the researcher's theory can be compared with existing theories in the literature. The argument for"
    },
    {
        "page": "199",
        "text": "7 Do the researchers use the interview findings to make generalizations about a larger population? Is this appropriate? 8 What limitations in their interviews do the researchers recognize? 9 Can you identify other flaws or omissions in the"
    },
    {
        "page": "223",
        "text": "Here are some of them, with examples. Yes/no answers Have you evaluated your company's website in the past 6 months? Yes/No Does your company use any open source software? Yes/No Quantity questions How old were you at your last"
    },
    {
        "page": "330",
        "text": " analysis) and research process model 33, 35 experts 159 see also practitioner-researchers; practitioners explanation 127-8, 296 explanatory case studies 143 exploratory case studies 143 external validity 132-3, 288, 294 F, Mand A 156-7,"
    },
    {
        "page": "78",
        "text": "You might also find that an academic community has assembled lists of references on particular topics and made them available on the web. For example, at the time of writing, the ISWorld website (www.isworld.org) offers lists of references on"
    },
    {
        "page": "36",
        "text": "Often involves looking, but it can involve the other senses too: hearing, smelling, touching and tasting. (See Chapter 14.) • Questionnaire: a pre-defined set of questions assembled in a pre-determined order. Respondents are asked to answer"
    },
    {
        "page": "219",
        "text": "A questionnaire is a pre-defined set of questions (sometimes called items), assembled in a pre-determined order. Respondents are asked to answer the questions, thus providing the researcher with data that can be analysed and interpreted."
    },
    {
        "page": "159",
        "text": "Those who remain powerless to influence the processes of information gathering, the identification of truth, and the dissemination of findings are usually the subjects of the research, those very people whose interests the research may purport"
    },
    {
        "page": "306",
        "text": "McGrath (2005) discusses the nature of critical research in IS and examines two key IS texts whose authors claim to have a critical agenda but pursue it in different ways (Avgerou, 2002; Walsham, 2001). She argues that critical researchers"
    },
    {
        "page": "164",
        "text": "organization benefits? Just the powerful?). Instead, it asks, 'Do people whose reputations and livelihoods are affected act differently as a result of the inquiry?' This applies as much to the academic researchers as to other participants, implying"
    },
    {
        "page": "254",
        "text": "However, they are dependent on the researcher's individual interpretations of the data, aided by tables and charts whose formats the researcher decides. Statistical techniques, on the other hand, offer more universal means and criteria for"
    },
    {
        "page": "20",
        "text": "For example, you could work on an IT help-desk and find out about how your co-workers view the end-users who call in with problems. Are they seen as customers, whose needs are paramount, or are they seen as the enemy? To create more"
    },
    {
        "page": "xvi",
        "text": "The lecturer can require that some other research paper be studied and evaluated - one whose content is known to be relevant and at an appropriate level for the class members. • The students can be asked to do a literature search to find and"
    },
    {
        "page": "145",
        "text": "It's important that you inform your readers to what extent you judge your chosen case is typical of other cases in its class, or whether you feel your chosen case is unique, interesting in its own right but whose findings are unlikely to be"
    },
    {
        "page": "110",
        "text": "This way of using an IT product is sometimes used by students who do not want to concentrate on technical development, but whose institution requires that there be a technical implementation element to their research project. Examples of"
    },
    {
        "page": "126",
        "text": "Had an accident occurred on a road feeding into my route, so fewer cars were able to join my route? Had there been an item on the radio warning of possible disruptions on my route and advising drivers to take a different road? Academic"
    },
    {
        "page": "315",
        "text": "You can use transparencies and an overhead projector instead of a computer- supported presentation. However, as this is becoming less common, check with the conference organizers that an overhead projector and screen will be available."
    },
    {
        "page": "159",
        "text": " you will be collaborative (an equal co-worker with the subjects), facilitative (the organizational members solve the immediate problem, supported by your advice) or expert (you bear the responsibility for solving the immediate problem)."
    },
    {
        "page": "306",
        "text": "Trauth and jessop (2000) show how different results emerge from an assessment of an IT system (computer-supported discussion) when the 'lens' by which it is viewed shifts from positivism to interpretivism. Klein and Myers (1999) propose a"
    },
    {
        "page": "150",
        "text": "Their presentations are available online at: www.people.vcu.edu/~aslee/ICIS2000/ICIS2000-Panel-Markusl983.htm Star and Ruhleder (1996) look at the case of the development of a large-scale CSCW (computer-supported collaborative"
    },
    {
        "page": "313",
        "text": "Make sure, for example, that you know the difference between: where/were, affect/ effect, there/their, it's/its, practice/practise. Your assertions and conclusions should always be supported by evidence; they should not appear as if from"
    },
    {
        "page": "43",
        "text": " Internet offers both new research topics and new ways of doing research. Many readers of this book are likely to do research into, or supported by, the Internet, so this chapter pulls together some of the themes and issues of Internet research."
    },
    {
        "page": "23",
        "text": "For example, a case study of a particular systems development department that decides to move from its existing method to an approach using UML; or an investigation of a company's website: its original conception, its evolution, its outcomes,"
    },
    {
        "page": "238",
        "text": "For all statistics you should ask: q Whether counting and measuring the object under investigation is easy and straightforward. For example, counting the population of a country may be hampered by unknown numbers of homeless people and"
    },
    {
        "page": "142",
        "text": " context are not clearly evident. (Yin, 2003b) A case study is characterized by: q Focus on depth rather than breadth: the researcher obtains as much detail as possible about one instance of the phenomenon under investigation. q Natural"
    },
    {
        "page": "141",
        "text": " detailed insight into the 'life' of that case and its complex relationships and processes. If using a survey (see Chapter 7), a researcher is able to take a wide but only shallow view of lots of instances of the phenomenon under investigation and"
    },
    {
        "page": "45",
        "text": "Yet it has been noted that there has been surprisingly little investigation of email by IS and computing researchers (Weber, 2004). There are research opportunities to examine email behaviour and develop better systems that help users to"
    },
    {
        "page": "229",
        "text": "Examples of work in IS and computing of questionnaire-based research include: • An investigation via questionnaire into technology adoption and sustained use of it, which suggests that the often-cited technology acceptance model (Davis,"
    },
    {
        "page": "152",
        "text": "London: Penguin. Lee, A.S. (1994). Electronic mail as a medium for rich communication: An empirical investigation using hermeneutic interpretation. MIS Quarterly, 18(2), 143-157. Markus, M.L. (1983). Power, politics and MIS implementation."
    },
    {
        "page": "27",
        "text": "If they do, this would be interesting and worth further investigation. But if they do not, the result is not particularly interesting. A better research topic, with useful outcomes whatever they are, would be to investigate what factors contribute to"
    }
]
